{
  "backend/main.mo": "Defines types and in‑memory state for users, products, orders, coupons, referrals, and includes admin‑gated sample product migration.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files describing their roles in routing, UI, hooks, and state management.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark design tokens and applying global styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README.md": "Frontend documentation outlining features, tech stack, and local development setup steps.",
  "frontend/src/App.tsx": "Configures the TanStack Router, theme provider, and i18n wrapper, defining all user and admin routes.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin UI component showing Stripe configuration status using a query hook.",
  "frontend/src/components/home/BannerCarousel.tsx": "Renders a looping carousel of homepage banner images.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Displays a grid of categories with loading states and navigation to filtered catalog views.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with header, footer, and handles Internet Identity initialization state.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with copyright text and a referral link to caffeine.ai. Includes dynamic year and encoded hostname.",
  "frontend/src/components/layout/Header.tsx": "Implements the main header with navigation, search, user auth handling, theme/language toggles, and cart count. Uses various hooks for identity, cart, and admin checks.",
  "frontend/src/components/LoadingSkeletons.tsx": "Provides reusable skeleton loaders for product cards, grids, categories, and order rows.",
  "frontend/src/components/product/ProductCard.tsx": "Displays a product card with image, price, stock status, and add‑to‑cart button. Handles login checks and cart mutation with toast notifications.",
  "frontend/src/components/product/ProductImage.tsx": "Shows a product image with fallback and error handling. Defaults to a placeholder if the URL is missing or fails to load.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines reusable React Query keys for products, cart, orders, and other backend data. Provides helpers for parameterized keys.",
  "frontend/src/hooks/queries/useAuthz.ts": "Provides hooks to fetch caller user role and admin status from the backend. Uses actor-based queries with optional token-based admin validation.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Hooks for fetching and mutating cart and wishlist data. Supports adding items to cart and auto‑invalidates affected queries.",
  "frontend/src/hooks/queries/useCatalog.ts": "Queries products and categories and triggers sample-product migration if the list is empty. Supports filtering and category fetching.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all coupons from the backend using React Query. Enabled only when actor is available.",
  "frontend/src/hooks/queries/useOrders.ts": "Provides hooks to fetch all customer orders or a single order with polling. Requires authenticated identity for customer queries.",
  "frontend/src/hooks/queries/useReferrals.ts": "Retrieves referral user IDs for the logged‑in user. Query key includes the user's principal.",
  "frontend/src/hooks/queries/useStripe.ts": "Checks if Stripe is configured on the backend via a simple boolean query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, including access control initialization. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, status tracking, and identity restoration. Wraps AuthClient with custom options.",
  "frontend/src/hooks/useTheme.ts": "Thin wrapper around next-themes exposing theme, setter, and dark-mode flag.",
  "frontend/src/i18n/index.tsx": "Provides translation context and English/Hindi string dictionaries for UI text.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page listing total categories with a simple loading state.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Admin page showing available coupons count with loading handling.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing basic metrics like orders, revenue, and product count.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin layout handling authentication, token validation, navigation, and sidebar menu rendering.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form handling authentication, error display, and token storage.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page placeholder indicating upcoming order management features.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page with search, sorting, and product table display.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin page placeholder for future user management features.",
  "frontend/src/pages/CartPage.tsx": "Displays the user’s cart, calculates subtotal, and provides a checkout navigation flow.",
  "frontend/src/pages/CatalogPage.tsx": "Implements product catalog with filters, sorting, search syncing, and category selection.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including payment selection, order summary, and simulated order placement.",
  "frontend/src/pages/HomePage.tsx": "Renders homepage with banners, categories, and a featured products section.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a completed order with navigation options.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Displays the logged‑in user's orders with loading, empty, and list states, allowing navigation to order details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Shows detailed information for a specific order, including status, date, total, and item list, with loading and not-found states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success message with options to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product info, stock status, and actions for adding to cart or wishlist.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page rendering a card indicating that address management is coming soon.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Profile section layout with tabs for overview, addresses, and settings, gated behind user authentication.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Provides UI to change theme (dark/light) and app language using select and switch controls.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's wishlist or prompts login, showing products or an empty state.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, containers, animations, plugins, and extended styling tokens.",
  "project_state.json": "Project state metadata describing requirements, architecture notes, known issues, and existing features with versions."
}