{
  "backend/main.mo": "Defines the main backend canister with authorization mixins, domain types, and state maps for users, products, orders, carts, coupons, referrals, Stripe sessions, and site settings.",
  "feature_evidence.json": "Contains structured feature evidence reports mapping feature IDs to affected files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of numerous frontend files including hooks, layout components, and pages.",
  "frontend/index.css": "Defines global Tailwind CSS layers and light/dark theme CSS variables for UI styling.",
  "frontend/index.html": "Basic HTML entry document setting the root mount point and loading the React application.",
  "frontend/README.md": "Project README describing the BISAULI Store frontend, its features, setup steps, and development prerequisites.",
  "frontend/src/App.tsx": "Sets up the full routing tree using TanStack Router, including public, profile, checkout, and admin routes wrapped with theme and i18n providers.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin form to configure Stripe secret key and allowed countries with validation and mutation handling.",
  "frontend/src/components/home/BannerCarousel.tsx": "Displays a looping carousel of static banner images.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Fetches and displays product categories in a grid with skeleton loading and navigation.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, loading state, and document title setup.",
  "frontend/src/components/layout/Footer.tsx": "Renders footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar with branding, search, auth handling, theme/language controls, and cart count.",
  "frontend/src/components/LoadingSkeletons.tsx": "Provides reusable skeleton loading components for product cards, grids, categories, and order rows.",
  "frontend/src/components/product/ProductCard.tsx": "Shows a product card with image, price, stock status, and add-to-cart logic.",
  "frontend/src/components/product/ProductImage.tsx": "Displays a product image with a fallback placeholder and error handling.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Provides centralized React Query keys for all data entities.",
  "frontend/src/hooks/queries/useAuthz.ts": "Queries user role and admin status from the backend actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Handles cart and wishlist queries plus add-to-cart mutation with cache updates.",
  "frontend/src/hooks/queries/useCatalog.ts": "Fetches products and categories from the catalog API with optional filters.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all coupons using the backend actor.",
  "frontend/src/hooks/queries/useOrders.ts": "Fetches customer orders and individual order details with polling.",
  "frontend/src/hooks/queries/useReferrals.ts": "Retrieves referral user IDs for the authenticated user.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Gets and updates site settings while enforcing BISAULI branding.",
  "frontend/src/hooks/queries/useStripe.ts": "Stripe hooks using react-query to check configuration status and update Stripe settings via admin actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin actor on mount and exposes it with a fetching state.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the document title to a provided value or a default.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, storage, status tracking, and context via an AuthClient.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes to expose theme, setter, and dark-mode flag.",
  "frontend/src/i18n/index.tsx": "Implements a simple i18n system with English and Hindi translations and context-based access.",
  "frontend/src/index.css": "Tailwind base/theme definitions including light and dark mode CSS variables.",
  "frontend/src/main.tsx": "App entrypoint setting up QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin view listing categories with basic loading and count display.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Admin page showing available coupons with simple loading and count info.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying placeholder metrics for orders, revenue, and products.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin layout with sidebar navigation and an outlet for nested admin pages.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Empty file placeholder for the admin login page.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays admin order management stub with a placeholder card.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product search, sorting, and listing UI using catalog query hooks.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Handles viewing and updating site branding settings including logo upload and validation.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "User management placeholder page with basic layout.",
  "frontend/src/pages/CartPage.tsx": "Cart page displaying user cart items, subtotal, and checkout flow with identity checks.",
  "frontend/src/pages/CatalogPage.tsx": "Displays product catalog with filters, sorting, and synced URL search params, fetching products and categories.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders checkout flow with cart summary, payment method selection, and simulated order placement.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage with banner, categories, and featured products fetched from the catalog.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays confirmation message for a placed order with navigation options.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Displays a logged‑in user's order list with status, totals, and navigation to details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Shows detailed information for a specific order including items, totals, and status.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure notice and links to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows successful payment message with options to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with add-to-cart and wishlist actions, handling loading and stock states.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page for managing user addresses.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Profile layout with auth check and tabbed navigation for profile sections.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Provides user preference controls for theme and language selection.",
  "frontend/src/pages/WishlistPage.tsx": "Shows user's wishlist products or prompts login, handling loading and empty states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Defines project state, goals, architectural notes, and known issues, mainly focusing on admin authentication removal and enforcing the 'BISAULI' branding."
}