{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality including user profiles, products, categories, cart, wishlist, orders, coupons, referrals, Stripe integration, admin authorization, and blob storage with migration support.",
  "backend/migration.mo": "Migration module that initializes sample products and categories if the old actor state is empty, preserving existing data otherwise.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, hooks, pages, routing, authentication, catalog, cart, orders, admin features, and error handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point with meta tags, theme color, and script tag loading the React application from main.tsx.",
  "frontend/public/manifest.webmanifest": "Empty web manifest file (no content).",
  "frontend/public/offline.html": "Empty offline fallback HTML file (no content).",
  "frontend/public/sw.js": "Empty service worker JavaScript file (no content).",
  "frontend/README.md": "Frontend documentation describing features, application routes (public, user, admin, payment), tech stack, and local development setup instructions.",
  "frontend/scripts/clean-build.sh": "Bash script that performs a clean build by removing caches, reinstalling dependencies, running type checks, and building the application with post-deployment validation checklist.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (public, user, admin), ThemeProvider, TranslationProvider, Toaster, error boundaries, and service worker cleanup on mount.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Dialog component for adding or editing product categories with name and image upload (data URL) support, including validation, error handling, and retry functionality.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for adding or editing products with fields for name, description, price, stock, category selection, and image upload (data URL), including validation and error handling with retry capability.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin configuration page for setting up Stripe payment integration by entering secret key and allowed country codes, displaying current configuration status.",
  "frontend/src/components/category/CategoryImage.tsx": "Reusable image component that displays category images with fallback to placeholder on error or missing URL, supporting both remote URLs and data URLs.",
  "frontend/src/components/errors/AppErrorFallback.tsx": "Error fallback UI component that displays a user-friendly error message with a refresh button when the application encounters an unexpected error.",
  "frontend/src/components/errors/RootErrorBoundary.tsx": "React error boundary class component that catches uncaught errors in the component tree and displays the AppErrorFallback component.",
  "frontend/src/components/home/BannerCarousel.tsx": "Carousel component displaying two rotating home page banner images with navigation controls.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Grid component displaying product categories as clickable cards with images, loading skeletons, error handling with retry, and navigation to catalog filtered by category.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component that wraps the application with header, footer, and outlet for nested routes.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying company info, quick links, social media icons, copyright notice, and attribution to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header component with logo, search, cart/wishlist badges, theme/language switchers, and authentication controls. Includes responsive mobile menu and enforces BISAULI branding.",
  "frontend/src/components/LoadingSkeletons.tsx": "Reusable skeleton loading components for product cards, product grids, category cards, and order rows using shadcn/ui Skeleton primitives.",
  "frontend/src/components/product/ProductCard.tsx": "Product card component displaying product image, name, price, stock status, and add-to-cart button. Links to product detail page and shows out-of-stock badge when applicable.",
  "frontend/src/components/product/ProductImage.tsx": "Image component for product display with fallback to placeholder on error or missing URL. Handles both remote URLs and data URLs with lazy loading.",
  "frontend/src/components/pwa/A2HSInstallPrompt.tsx": "Empty file for Add-to-Home-Screen PWA install prompt component.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Empty file for offline status banner component.",
  "frontend/src/components/vendor/VendorDashboard.tsx": "Empty file for vendor dashboard component.",
  "frontend/src/components/vendor/VendorLoginForm.tsx": "Empty file for vendor login form component.",
  "frontend/src/components/vendor/VendorProductEditorDialog.tsx": "Empty file for vendor product editor dialog component.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "React Query mutation hook for placing orders with shipping address. Invalidates cart, orders, dashboard stats, and products queries on success.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Centralized query key definitions for React Query, separating public/shopper keys from admin-scoped keys for products, categories, cart, orders, and settings.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Admin-scoped hooks for managing products and categories (CRUD operations) using admin actor. Invalidates both admin and public product/category queries on mutations.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Admin health check hook using anonymous admin actor to verify backend canister availability. Polls every 30 seconds and returns health status.",
  "frontend/src/hooks/queries/useAdminOrders.ts": "Hooks for fetching all orders and updating order status using public actor. Invalidates admin orders, customer orders, and dashboard stats on status updates.",
  "frontend/src/hooks/queries/useAuthz.ts": "Authorization hooks for checking caller user role and admin status using authenticated actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Hooks for cart and wishlist operations (get, add, increment, decrement, remove) requiring authentication. Handles backend unavailability errors and invalidates cart/wishlist queries on mutations.",
  "frontend/src/hooks/queries/useCatalog.ts": "Provides React Query hooks for fetching products and categories from the public actor with timeout handling, error formatting, and caching strategies.",
  "frontend/src/hooks/queries/useCoupons.ts": "Exports a React Query hook to fetch all coupons using the authenticated actor.",
  "frontend/src/hooks/queries/useDashboardStats.ts": "Provides a React Query hook to fetch dashboard statistics (total orders and revenue) using the admin actor with timeout and error handling.",
  "frontend/src/hooks/queries/useOrders.ts": "Exports React Query hooks for fetching customer orders and individual order details with polling intervals.",
  "frontend/src/hooks/queries/useReferrals.ts": "Provides a React Query hook to fetch user referrals using the authenticated actor and Internet Identity.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Exports hooks for fetching and updating site settings, enforcing 'BISAULI' as the shop name with caching and refetch strategies.",
  "frontend/src/hooks/queries/useStripe.ts": "Provides React Query hooks and mutations for checking Stripe configuration status and setting Stripe configuration via admin actor.",
  "frontend/src/hooks/queries/useVendorProducts.ts": "Empty file with no content.",
  "frontend/src/hooks/useA2HS.ts": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor based on Internet Identity, initializing access control with admin token and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminActor.ts": "Wraps useActor to provide an admin-specific actor hook requiring Internet Identity authentication and admin role.",
  "frontend/src/hooks/useDocumentTitle.ts": "Custom hook to dynamically update the document title, defaulting to 'BISAULI' if no title is provided.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages an anonymous public actor for read-only catalog access without authentication.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes useTheme hook to provide theme state and setter with dark mode detection.",
  "frontend/src/i18n/index.tsx": "Implements internationalization context and translations for English and Hindi languages covering navigation, products, cart, checkout, orders, profile, admin, and common UI strings.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm color palette for light and dark modes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for managing product categories with CRUD operations (add, edit, delete). Includes backend availability detection, error handling with retry functionality, and confirmation dialogs for deletions.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Basic admin page displaying coupon count and management interface placeholder. Currently shows loading state and total coupon count.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard displaying statistics and product overview with refresh functionality. Handles authentication errors and provides retry mechanisms for failed data fetches.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin panel layout with sidebar navigation, backend health status indicator, and session management. Provides menu items for all admin sections and displays backend availability status with retry options.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin authentication page using Internet Identity with role verification. Handles login flow, clears stale sessions, and redirects to admin dashboard upon successful admin role verification.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with status updates, sorting by timestamp, and error handling with retry functionality.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for managing products with search, sorting, CRUD operations (add, edit, delete), and a confirmation dialog for deletions.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin page for updating site branding settings, specifically the shop logo (with image upload, validation, and data URL conversion).",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder admin page for user management features that are not yet implemented.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls (increment/decrement), product details, subtotal calculation, and checkout navigation. Requires user authentication and handles empty cart states.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page with filtering (category, price range, search), sorting, and URL-synced state. Displays products in a grid with loading skeletons and error handling with retry functionality.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with shipping address form validation (name, phone, address, pincode), order summary display, and order placement functionality. Redirects to order confirmation on success.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a banner carousel, featured products section (first 8 products), and categories grid with loading states and error handling.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying success message with order ID and navigation buttons to view orders or continue shopping.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Customer-facing page displaying all orders for the logged-in user with order status badges and navigation to order details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Customer-facing page showing detailed information for a specific order including items, status, date, and total amount.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page showing error message with options to retry payment or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page displaying confirmation message with navigation to orders or home page.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product information including image, name, price, description, and stock status. Allows authenticated users to add products to cart or wishlist with toast notifications.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder profile page for address management features that are not yet implemented.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Layout wrapper for profile pages with tabbed navigation (overview, addresses, settings) and authentication check.",
  "frontend/src/pages/profile/SettingsPage.tsx": "User settings page for toggling dark mode theme and selecting language (English or Hindi).",
  "frontend/src/pages/vendor/VendorPage.tsx": "Empty vendor page file with no implementation.",
  "frontend/src/pages/WishlistPage.tsx": "Shows user's wishlist with product cards, requiring authentication to view. Displays empty state with navigation to catalog if no items exist.",
  "frontend/src/utils/adminSessionReset.ts": "Utility function to clear all admin session data by removing localStorage, sessionStorage, and expiring accessible cookies.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Provides utility functions to detect and format backend canister unavailability errors (IC0508, network issues, deployment problems) into user-friendly messages.",
  "frontend/src/utils/orderStatus.ts": "Shared utilities for order status presentation including label mapping, badge color variants, and available status options for admin dropdowns.",
  "frontend/src/utils/serviceWorker.ts": "Utility function to unregister all service workers to prevent PWA behavior from affecting page performance.",
  "frontend/src/utils/urlParams.ts": "Utilities for parsing URL parameters from query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/src/utils/vendorSession.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme properties, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document indicating an e-commerce app with empty products/categories data requiring backend data fetching fixes and sample data population."
}