{
  "backend/main.mo": "Defines the backend canister with types and in‑memory maps for users, products, categories, carts, orders, coupons, referrals, and settings, plus access control and basic query endpoints.",
  "backend/migration.mo": "Migration module converting categories from old format to new format by adding an image field.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test coverage.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files and components.",
  "frontend/index.css": "Global Tailwind CSS setup defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "Base HTML template loading the React app and disabling caching.",
  "frontend/README.md": "Project documentation explaining features, routes, development setup, and admin/vendor access instructions.",
  "frontend/src/App.tsx": "Main React router configuration defining all customer, admin, and vendor routes with layout wrappers.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Dialog for adding or editing categories with image upload, validation, and retry logic on backend failures.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog for creating or updating products with full form state, image validation, and backend retry support.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Form for configuring Stripe secret keys and allowed countries, showing current configuration status.",
  "frontend/src/components/category/CategoryImage.tsx": "Renders a category image with fallback handling for missing or failed image sources.",
  "frontend/src/components/home/BannerCarousel.tsx": "Displays a looping carousel of home page banner images using the UI carousel component.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Shows a clickable grid of categories with images, handling loading and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, footer, document title, and loading state tied to identity initialization.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, vendor link, and a powered‑by attribution link.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation, search, auth controls, theme/language toggles, and cart count.",
  "frontend/src/components/LoadingSkeletons.tsx": "Provides skeletal loading components for products, categories, and order rows using UI skeleton elements.",
  "frontend/src/components/product/ProductCard.tsx": "Displays a product card with image, price, stock status, and add‑to‑cart handling including identity checks and toasts.",
  "frontend/src/components/product/ProductImage.tsx": "Renders a product image with a fallback placeholder and error handling for invalid URLs.",
  "frontend/src/components/vendor/VendorDashboard.tsx": "Vendor dashboard listing products with add, edit, and delete actions, plus error handling and dialogs.",
  "frontend/src/components/vendor/VendorProductEditorDialog.tsx": "Dialog for creating or editing products, handling form state, image uploads, validation, and submit mutations.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "Mutation hook for placing orders with identity checks, backend error handling, and cache invalidation on success.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines and exports all React Query cache keys used throughout the app.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Admin queries and mutations for managing products and categories using an anonymous admin actor.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Admin health check hook that pings the backend and tracks availability state.",
  "frontend/src/hooks/queries/useAdminOrders.ts": "Admin hooks for fetching all orders and updating order statuses with appropriate cache invalidations.",
  "frontend/src/hooks/queries/useAuthz.ts": "Hooks to fetch the caller’s user role and check admin authorization via the backend actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Defines React Query hooks for fetching and mutating cart and wishlist data, handling identity checks and backend availability errors.",
  "frontend/src/hooks/queries/useCatalog.ts": "Provides hooks to fetch products and categories from the backend with optional filters and caching behavior.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all available coupons using the actor with simple enable logic.",
  "frontend/src/hooks/queries/useDashboardStats.ts": "Fetches all orders using the admin actor and computes total orders and revenue.",
  "frontend/src/hooks/queries/useOrders.ts": "Provides hooks to fetch customer orders and a specific order with polling and identity checks.",
  "frontend/src/hooks/queries/useReferrals.ts": "Fetches referral user IDs for the logged‑in user keyed by their principal.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Gets and updates site settings via the admin actor, enforcing a fixed shop name and managing cache updates.",
  "frontend/src/hooks/queries/useStripe.ts": "Defines hooks to check Stripe configuration and update it via the admin actor with cache invalidation.",
  "frontend/src/hooks/queries/useVendorProducts.ts": "Vendor‑scoped hooks for listing, adding, updating, and deleting products with query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the user's identity and invalidates dependent queries on changes.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin‑level actor on mount for privileged operations.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the document title to a given value or a default.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, loading and managing authentication state with AuthClient.",
  "frontend/src/hooks/useTheme.ts": "Thin wrapper around next‑themes providing theme, setter, and dark‑mode boolean.",
  "frontend/src/i18n/index.tsx": "Provides a React context for language selection and a translations dictionary for English and Hindi UI strings.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, including color palettes and layout tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Provides category management with create, edit, delete, and backend error handling features.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Shows a simple admin view listing total available coupons with loading support.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin stats for orders, revenue, and products with refresh and error handling.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Defines the admin panel layout with navigation and backend health status indicator.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Shows an informational page explaining open admin access and links to the admin panel.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin UI for listing orders, handling loading/error states, and updating order statuses with sorting and status helpers.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page supporting search, sorting, editing, deleting, and backend error handling.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin page for editing site settings, mainly logo upload, validation, and saving updates with error handling.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder admin user management page showing a coming‑soon message.",
  "frontend/src/pages/CartPage.tsx": "Renders the user's cart with product details, quantity controls, subtotal calculation, and navigation for empty or unauthenticated states.",
  "frontend/src/pages/CatalogPage.tsx": "Displays the product catalog with filters for category, price, search text, and sorting, syncing state with URL parameters.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout flow including address form validation, cart summary, and order placement using backend mutation.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with a banner, categories section, and featured products with loading skeletons.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a confirmation message after an order is placed and provides navigation to orders or home.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Displays customer orders with loading, empty states, and navigation to individual order details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Shows detailed information for a single order including status, totals, and item list with loading/error states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a success message after payment and provides navigation to orders or home.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product info, handles add-to-cart and wishlist actions, and manages loading or missing product states.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page indicating address management features are not yet implemented.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Profile layout with authentication check and tab navigation for profile sections.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Profile settings page allowing users to change theme and language preferences.",
  "frontend/src/pages/vendor/VendorPage.tsx": "Vendor login page using Internet Identity that shows a dashboard when authenticated and supports login/logout handling.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's wishlist, handles loading and empty states, and requires login to view content.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Utility for detecting backend unavailability and formatting user-friendly error messages, including IC0508 and network issues.",
  "frontend/src/utils/orderStatus.ts": "Maps order status enums to labels, colors, and provides the list of all statuses.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout with plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state, priorities, architectural notes, and known issues for the app’s development and deployment."
}