{
  "backend/main.mo": "Main Motoko actor implementing an e-commerce backend with user profiles, products, categories, cart, wishlist, orders, coupons, referrals, Stripe integration, role-based access control, and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including React components, hooks, pages, routing, internationalization, theme management, and query client configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color tokens for UI components and charts.",
  "frontend/index.html": "HTML entry point with meta tags, theme color, and script tag loading the React application from main.tsx.",
  "frontend/public/manifest.webmanifest": "Empty web manifest file (no content).",
  "frontend/public/offline.html": "Empty offline fallback HTML file (no content).",
  "frontend/public/sw.js": "Empty service worker JavaScript file (no content).",
  "frontend/README.md": "Frontend documentation describing features, application routes (public, user, admin, payment), tech stack, and local development setup instructions.",
  "frontend/scripts/clean-build.sh": "Bash script that performs a clean build by removing caches, reinstalling dependencies, running TypeScript checks, building the app, and displaying a post-deployment validation checklist.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (public, user, admin), ThemeProvider, TranslationProvider, Toaster, RootErrorBoundary, and service worker cleanup on mount.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Dialog component for adding or editing product categories with name and image upload (file or data URL), includes validation, error handling, and retry logic for failed operations.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog component for adding or editing products with fields for name, description, price, stock, category selection, and image upload, includes validation, error handling, and retry functionality.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin configuration page for setting up Stripe payment integration by entering secret key and allowed country codes, displays current configuration status.",
  "frontend/src/components/category/CategoryImage.tsx": "Reusable image component for displaying category images with fallback to placeholder on error or missing URL, supports both remote URLs and data URLs.",
  "frontend/src/components/errors/AppErrorFallback.tsx": "Error fallback UI component displaying a user-friendly error message with a refresh button when the application encounters an unexpected error.",
  "frontend/src/components/errors/RootErrorBoundary.tsx": "React error boundary class component that catches unhandled errors in the component tree and displays the AppErrorFallback component.",
  "frontend/src/components/home/BannerCarousel.tsx": "Carousel component displaying rotating home page banner images with navigation controls using shadcn/ui carousel component.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Grid display of product categories with loading skeletons, error handling with retry, and navigation to catalog filtered by category on click.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component providing the structure with header, main content outlet, and footer for all pages.",
  "frontend/src/components/layout/Footer.tsx": "Application footer with company info, quick navigation links, social media icons, copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Main navigation header component with logo, search, cart, wishlist, user authentication, theme toggle, and language selector. Includes responsive mobile menu and enforces BISAULI branding.",
  "frontend/src/components/LoadingSkeletons.tsx": "Reusable skeleton loading components for product cards, product grids, category cards, and order rows using shadcn/ui Skeleton primitives.",
  "frontend/src/components/product/ProductCard.tsx": "Product card component displaying product image, name, price, stock status, and add-to-cart button. Links to product detail page and handles authentication checks.",
  "frontend/src/components/product/ProductImage.tsx": "Reusable product image component with fallback placeholder handling for missing or invalid image URLs, supporting both remote URLs and Data URLs.",
  "frontend/src/components/pwa/A2HSInstallPrompt.tsx": "Empty file for Add-to-Home-Screen PWA install prompt component.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Empty file for offline status banner component.",
  "frontend/src/components/vendor/VendorDashboard.tsx": "Empty file for vendor dashboard component.",
  "frontend/src/components/vendor/VendorLoginForm.tsx": "Empty file for vendor login form component.",
  "frontend/src/components/vendor/VendorProductEditorDialog.tsx": "Empty file for vendor product editor dialog component.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "React Query mutation hook for placing orders with shipping address, invalidating cart/orders/dashboard/products queries on success and handling backend unavailability errors.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Centralized query key definitions for React Query, separating public/shopper keys from admin-scoped keys for products, categories, cart, orders, coupons, and settings.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Admin-scoped React Query hooks for managing products and categories (CRUD operations) using the admin actor, with query invalidation and error formatting.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Admin-scoped health check hook using anonymous admin actor to verify backend canister availability, with periodic refetching and status reporting.",
  "frontend/src/hooks/queries/useAdminOrders.ts": "React Query hooks for fetching all orders and updating order status using public actor, invalidating related queries on success.",
  "frontend/src/hooks/queries/useAuthz.ts": "Authorization hooks for fetching caller user role and checking admin status using authenticated actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "React Query hooks for cart and wishlist operations (get, add, increment, decrement, remove) with authentication checks and backend unavailability error handling.",
  "frontend/src/hooks/queries/useCatalog.ts": "Provides React Query hooks for fetching products and categories from the public actor with timeout handling, error formatting, and caching strategies.",
  "frontend/src/hooks/queries/useCoupons.ts": "Exports a React Query hook to fetch all coupons using the authenticated actor.",
  "frontend/src/hooks/queries/useDashboardStats.ts": "Provides a React Query hook to fetch dashboard statistics (total orders and revenue) using the admin actor with timeout and error handling.",
  "frontend/src/hooks/queries/useOrders.ts": "Exports React Query hooks for fetching customer orders and individual order details with polling intervals.",
  "frontend/src/hooks/queries/useReferrals.ts": "Provides a React Query hook to fetch user referrals using the authenticated actor and Internet Identity.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Exports hooks for fetching and updating site settings, enforcing 'BISAULI' as the shop name with caching and refetch strategies.",
  "frontend/src/hooks/queries/useStripe.ts": "Provides React Query hooks to check Stripe configuration status and a mutation hook to set Stripe configuration via admin actor.",
  "frontend/src/hooks/queries/useVendorProducts.ts": "Empty file with no content.",
  "frontend/src/hooks/useA2HS.ts": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor based on Internet Identity state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAdminActor.ts": "Wraps useActor to provide an admin-specific actor hook that requires Internet Identity authentication and admin role.",
  "frontend/src/hooks/useDocumentTitle.ts": "Custom hook to dynamically update the document title, defaulting to 'BISAULI' if no title is provided.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validity.",
  "frontend/src/hooks/usePublicActor.ts": "Creates and manages an anonymous public actor for read-only catalog access without requiring authentication.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes to provide theme state and setter with a typed interface and isDark helper.",
  "frontend/src/i18n/index.tsx": "Implements internationalization context and translations for English and Hindi languages with keys for navigation, products, cart, checkout, orders, profile, admin, and common UI elements.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm color palette for light and dark modes, including colors for backgrounds, cards, buttons, charts, and sidebar components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for managing product categories with CRUD operations. Includes backend availability detection, error handling with retry functionality, and delete confirmation dialog.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Admin page displaying coupon management interface with basic loading state and coupon count display.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing statistics and product data with refresh functionality. Handles loading states, errors, and displays authorization-related error messages.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin panel layout with sidebar navigation, backend health check indicator, and session clearing functionality. Provides navigation to all admin sections with active route highlighting.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin authentication page using Internet Identity with role verification. Handles login flow, error states, and redirects authenticated admins to dashboard.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with status updates, sorting by timestamp, and error handling with retry functionality.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for managing products with search, sorting, CRUD operations (add, edit, delete), and a confirmation dialog for deletions.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin page for updating site branding settings, specifically the shop logo with image upload, preview, and validation (file type and size).",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder admin page for user management functionality that displays a \"coming soon\" message.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls (increment/decrement), product details, subtotal calculation, and checkout navigation. Requires user authentication and handles empty cart states.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page with filtering by category, price range, search text, and sorting by price. Syncs filters with URL parameters and displays products in a grid with loading and error states.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with shipping address form validation (name, phone, address, pincode), order summary display, and order placement functionality. Requires authentication and validates Indian phone/pincode formats.",
  "frontend/src/pages/HomePage.tsx": "Home page displaying a banner carousel, featured products grid (first 8 products), and categories grid with loading skeletons and error handling with retry functionality.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation success page displaying order ID with navigation options to view orders or continue shopping.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Customer-facing page displaying all orders for the logged-in user with order summaries, status badges, and navigation to order details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Displays detailed information for a specific order including status, date, total amount, and line items.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page with error message and options to retry payment or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success page with confirmation message and navigation to orders or home page.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product information including image, price, description, and stock status. Allows authenticated users to add products to cart or wishlist with toast notifications.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder profile page for address management that displays a \"coming soon\" message.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Layout wrapper for profile pages with tab navigation (overview, addresses, settings) and authentication check.",
  "frontend/src/pages/profile/SettingsPage.tsx": "User settings page for toggling dark mode theme and selecting language (English/Hindi).",
  "frontend/src/pages/vendor/VendorPage.tsx": "Empty vendor page file with no implementation.",
  "frontend/src/pages/WishlistPage.tsx": "Shows user's wishlist with product cards, requiring authentication. Displays empty state or loading skeleton when appropriate.",
  "frontend/src/utils/adminSessionReset.ts": "Utility function to clear all admin session data by removing localStorage, sessionStorage, and expiring accessible cookies.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Provides utility functions to detect and handle backend canister unavailability errors (IC0508, network issues, deployment problems) and format user-friendly error messages.",
  "frontend/src/utils/orderStatus.ts": "Shared utilities for order status presentation including label mapping, badge color variants, and available status options for admin dropdowns.",
  "frontend/src/utils/serviceWorker.ts": "Utility function to unregister all service workers to prevent PWA behavior from affecting page performance.",
  "frontend/src/utils/urlParams.ts": "Utilities for parsing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/src/utils/vendorSession.ts": "Empty file with no content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, container queries, typography plugin, and custom animations.",
  "project_state.json": "Project state tracking file for BISAULI project with pending feature requests to update admin login credentials to Username: Prashant, Password: Prashant80061."
}