{
  "backend/main.mo": "Defines core types and in‑memory state for users, products, categories, carts, orders, coupons, referrals, and sample product migration logic.",
  "feature_evidence.json": "Feature evidence report linking an admin login UI text‑update request to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files including routes, hooks, components, and pages.",
  "frontend/index.css": "Tailwind CSS base file defining light/dark theme CSS variables and global styling.",
  "frontend/index.html": "HTML entry point with a root div and script loading the main React application.",
  "frontend/README.md": "Frontend documentation describing features, tech stack, and setup instructions for local development.",
  "frontend/src/App.tsx": "Main React router configuration defining all customer and admin routes with layout and providers.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin component displaying Stripe configuration status using query hooks and translations.",
  "frontend/src/components/home/BannerCarousel.tsx": "Home page banner carousel rendering rotating generated images with navigation controls.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Fetches and displays categories in a clickable grid with loading skeletons and navigation.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout rendering header, footer, and outlet while handling Internet Identity initialization.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright text and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/layout/Header.tsx": "Header component with navigation, search, theme/language selectors, authentication handling, and cart count display.",
  "frontend/src/components/LoadingSkeletons.tsx": "Contains skeleton loading components for products, categories, and order rows.",
  "frontend/src/components/product/ProductCard.tsx": "Displays a product card with image, price, stock status, and add‑to‑cart logic.",
  "frontend/src/components/product/ProductImage.tsx": "Renders a product image with a fallback placeholder and error handling.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines all React Query cache keys for products, cart, orders, and related data.",
  "frontend/src/hooks/queries/useAuthz.ts": "Provides hooks to fetch user role and check admin status via backend actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Hooks for fetching cart and wishlist data and mutating cart state.",
  "frontend/src/hooks/queries/useCatalog.ts": "Hooks to fetch products and categories, with auto‑migration of sample products when empty.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all coupons from the backend actor.",
  "frontend/src/hooks/queries/useOrders.ts": "Hooks for retrieving customer orders and polling individual order status.",
  "frontend/src/hooks/queries/useReferrals.ts": "Fetches referral user IDs for the authenticated user.",
  "frontend/src/hooks/queries/useStripe.ts": "Checks if Stripe is configured on the backend.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useTheme.ts": "Wrapper hook around next‑themes providing theme state and setter.",
  "frontend/src/i18n/index.tsx": "Provides translation context with English and Hindi strings and exposes a translation hook.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Shows category management info with loading state and category count.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Displays coupon management overview with loading state and coupon count.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin dashboard metrics for orders, revenue, and products.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Provides admin layout, authentication checks, navigation, and logout handling.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin login flow with form validation, token storage, and error states.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Placeholder page indicating upcoming order management features.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages products with search, sorting, filters, and product table display.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder page indicating upcoming user management features.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, calculates subtotal, and offers navigation to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Implements product catalog with search, filtering, sorting, and category selection.",
  "frontend/src/pages/CheckoutPage.tsx": "Renders checkout flow with shipping placeholder, payment selection, and order summary.",
  "frontend/src/pages/HomePage.tsx": "Shows banner, categories grid, and featured products on the homepage.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details after purchase and navigation options.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Displays the user's order list with loading, empty, and authenticated states, allowing navigation to order details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Shows detailed information for a specific order, including status, date, total, and item list.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays payment failure message with retry and navigation options.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success message with options to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product info, stock status, and actions for adding to cart or wishlist.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page showing an upcoming address management feature.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Provides the profile layout with authentication check and tabbed navigation for profile sections.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Renders user settings for theme selection and language switching.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's wishlist, handling loading, empty state, and product rendering.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, and plugins.",
  "project_state.json": "Contains project metadata, feature states, issues, and architectural notes for the app."
}