{
  "backend/main.mo": "Defines core backend actor with types, storage maps, access control, and user/product/order/cart logic initialization. Many methods are declared but truncated.",
  "feature_evidence.json": "Feature evidence report listing PWA‑related features, their affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend React, hooks, and component files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling tokens.",
  "frontend/index.html": "Main HTML entry enabling PWA manifest, service worker registration, cache‑control headers, and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and installability settings.",
  "frontend/public/offline.html": "Standalone offline fallback HTML page with styling and basic offline feature info.",
  "frontend/public/sw.js": "Service worker implementing cache management, offline fallback, and network-first fetch handling.",
  "frontend/README.md": "Frontend documentation describing features, routes, setup steps, and PWA behavior of the BISAULI store.",
  "frontend/src/App.tsx": "Main React router setup defining routes for customer, admin, and vendor pages using TanStack Router.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Admin dialog for adding or editing a category with image upload, validation, and backend error handling.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Admin dialog for creating or updating products with form fields, image upload, validation, and retry logic.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin interface for configuring Stripe secret key and allowed countries with validation and status display.",
  "frontend/src/components/category/CategoryImage.tsx": "Image component that displays a category image with a fallback placeholder on error.",
  "frontend/src/components/home/BannerCarousel.tsx": "Renders a looping carousel of static homepage banner images.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Fetches and displays categories in a responsive grid with loading and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper including header, footer, offline banner, and PWA install prompt.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright, vendor login link, and caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation, search, user actions, cart count, theming, and language options.",
  "frontend/src/components/LoadingSkeletons.tsx": "Reusable loading skeleton components for product cards, grids, categories, and order rows.",
  "frontend/src/components/product/ProductCard.tsx": "Product card with image, price, stock status, and add‑to‑cart handling.",
  "frontend/src/components/product/ProductImage.tsx": "Product image component with fallback placeholder logic on load error.",
  "frontend/src/components/pwa/A2HSInstallPrompt.tsx": "Conditional Add‑to‑Home‑Screen prompt supporting iOS and standard install flows.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Shows an alert banner when the user is offline, based on browser online status.",
  "frontend/src/components/vendor/VendorDashboard.tsx": "Vendor dashboard for listing, adding, editing, and deleting products with error handling.",
  "frontend/src/components/vendor/VendorProductEditorDialog.tsx": "Dialog component for adding or editing vendor products, handling form state, validation, and image uploads.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "Mutation hook to place an order and invalidate related cache entries on success.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines centralized React Query cache keys for products, orders, categories, and other entities.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Admin hooks for fetching and mutating products and categories using the admin actor.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Runs periodic health checks against the admin backend actor and exposes status flags.",
  "frontend/src/hooks/queries/useAdminOrders.ts": "Admin hooks for retrieving all orders and updating order status with cache invalidation.",
  "frontend/src/hooks/queries/useAuthz.ts": "Hooks to fetch the caller's user role and check if the caller is an admin.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Hooks for retrieving and mutating cart and wishlist data with login checks and cache invalidation.",
  "frontend/src/hooks/queries/useCatalog.ts": "Public catalog hooks to fetch products and categories using the standard actor.",
  "frontend/src/hooks/queries/useCoupons.ts": "Hook to fetch all available coupons from the backend.",
  "frontend/src/hooks/queries/useDashboardStats.ts": "Fetches admin dashboard statistics by aggregating order data.",
  "frontend/src/hooks/queries/useOrders.ts": "Hooks for fetching customer orders and individual order details with periodic polling.",
  "frontend/src/hooks/queries/useReferrals.ts": "Hook to fetch referral user IDs for the currently authenticated user.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Provides React Query hooks to fetch and update site settings, enforcing a fixed shop name and caching behavior.",
  "frontend/src/hooks/queries/useStripe.ts": "Exposes hooks to check Stripe configuration status and update Stripe settings with cache invalidation.",
  "frontend/src/hooks/queries/useVendorProducts.ts": "Supplies CRUD hooks for vendor-owned products using React Query with automatic cache invalidation.",
  "frontend/src/hooks/useA2HS.ts": "Implements Add-to-Home-Screen prompt handling with install detection and dismissal tracking.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin actor for unrestricted admin operations.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the document title, defaulting to 'BISAULI' when none is provided.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including login, logout, state management, and identity loading.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes to expose theme state, setter, and dark-mode flag.",
  "frontend/src/i18n/index.tsx": "Defines a simple English/Hindi translation system with context, state, and lookup support.",
  "frontend/src/index.css": "Configures Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers, rendering the root component.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for listing, creating, editing, and deleting categories with backend error handling and dialogs.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Displays coupon count and loading state using a simple management card.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows dashboard stats including orders, revenue, and products with refresh and error handling.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Provides admin layout with sidebar navigation and backend health status indicator.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Static page explaining open admin access and linking to the admin panel.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists orders with status updates, loading/error states, and retry functionality.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product list with search, sorting, create/edit/delete dialogs, and backend availability checks.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin page to load, preview, validate, and upload a shop logo, then save updated site settings.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder admin users page displaying a basic card stating that user management is coming soon.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, handles quantity updates, calculates subtotal, and shows login or empty-cart states.",
  "frontend/src/pages/CatalogPage.tsx": "Renders the product catalog with filters, sorting, category selection, and URL-synced search parameters.",
  "frontend/src/pages/CheckoutPage.tsx": "Provides checkout form validation, displays cart summary, and submits orders after validating shipping details.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage sections including banners, categories, and featured products with loading states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and navigation options after a successful order.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Lists a customer's orders with status badges, handling login, loading, and empty states.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Displays detailed information for a specific order, including items, totals, and status.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success message with navigation to orders or home.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info, stock status, and actions to add to cart or wishlist.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page for managing saved addresses, indicating the feature is not yet implemented.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Profile layout with navigation tabs for overview, addresses, and settings, requiring user authentication.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Provides UI to change theme mode and language preferences.",
  "frontend/src/pages/vendor/VendorPage.tsx": "Vendor portal handling authentication and showing the vendor dashboard or login screen accordingly.",
  "frontend/src/pages/WishlistPage.tsx": "Shows the user's wishlist, handles loading and empty states, and lists saved products.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Utility functions to detect backend unavailability patterns and generate user-friendly error messages.",
  "frontend/src/utils/orderStatus.ts": "Utility mapping order status enums to labels, colors, and providing the list of available statuses.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and clear them from the URL.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state, priorities, architectural notes, known issues, and required assets for ongoing development and deployment."
}