{
  "backend/main.mo": "Main canister actor defining authorization, types, and in‑memory state for users, products, categories, carts, orders, coupons, referrals, and site settings.",
  "backend/migration.mo": "Simple migration module passing through existing state without changes.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Text file containing short summaries of many frontend files and their responsibilities.",
  "frontend/index.css": "Tailwind CSS base and theme variables for light and dark modes, plus global styles.",
  "frontend/index.html": "Base HTML template loading the React app entry point and disabling caching.",
  "frontend/README.md": "Project documentation describing features, local development steps, admin access, authentication, and Stripe setup.",
  "frontend/src/App.tsx": "Main router configuration wiring customer and admin routes with layouts and pages.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Dialog for creating or editing a category with form handling, validation, retry logic, and backend mutation hooks.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog for adding or editing products, including form state, image upload validation, category loading, and backend mutation handling.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin form to configure Stripe secret key and allowed countries with validation and status display.",
  "frontend/src/components/home/BannerCarousel.tsx": "Simple looping image carousel displaying homepage banner images.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Fetches and displays categories in a grid with loading state and navigation on click.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout with header, footer, loading state, and document title handling.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright info and a link attribution with dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Main site header with navigation, search, auth controls, theme/language selectors, and cart count.",
  "frontend/src/components/LoadingSkeletons.tsx": "Skeleton UI components for products, categories, and order rows using shadcn primitives.",
  "frontend/src/components/product/ProductCard.tsx": "Displays product details with image, price, stock status, and add‑to‑cart functionality.",
  "frontend/src/components/product/ProductImage.tsx": "Displays a product image with a placeholder fallback and error handling to swap to a default image.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "Provides a mutation to place an order, handles backend availability errors, and invalidates related queries on success.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines all React Query cache keys for products, orders, categories, settings, and other resources.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Admin hooks for fetching and mutating products and categories, with automatic query invalidation.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Runs periodic backend health checks using the admin actor and exposes status flags.",
  "frontend/src/hooks/queries/useAdminOrders.ts": "Admin hooks for retrieving all orders and updating their status with cache invalidation.",
  "frontend/src/hooks/queries/useAuthz.ts": "Provides queries for checking the caller’s user role and admin status.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "User hooks for fetching and mutating cart and wishlist items with identity checks and error handling.",
  "frontend/src/hooks/queries/useCatalog.ts": "Fetches public product and category data with optional filters.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all available coupons from the backend.",
  "frontend/src/hooks/queries/useDashboardStats.ts": "Computes and returns admin dashboard statistics derived from all orders.",
  "frontend/src/hooks/queries/useOrders.ts": "User queries for retrieving all customer orders and specific order details with periodic polling.",
  "frontend/src/hooks/queries/useReferrals.ts": "Fetches referral user IDs associated with the logged-in user.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Admin hooks for retrieving and updating site settings, enforcing a fixed shop name.",
  "frontend/src/hooks/queries/useStripe.ts": "Hooks for checking Stripe configuration status and updating Stripe settings with admin access.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin actor using a secret token and exposes its loading state.",
  "frontend/src/hooks/useDocumentTitle.ts": "Sets the page's document title, defaulting to BISAULI.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and managing login/logout flows.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes to expose theme state and a helper flag for dark mode.",
  "frontend/src/i18n/index.tsx": "Implements a simple i18n context with English and Hindi translation dictionaries.",
  "frontend/src/index.css": "Defines Tailwind layers plus light/dark CSS variables for a custom color system.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin interface for viewing, creating, editing, and deleting product categories with backend error handling.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Admin page listing available coupons with a simple loading state.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing high-level stats like orders, revenue, and product count with refresh support.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin panel layout with sidebar navigation and backend health status indicator wrapping nested admin pages.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Simple admin access info page with a link to the admin panel and no authentication flow.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin interface for viewing orders and updating order statuses with loading, error handling, and status change actions.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page supporting filtering, sorting, creating, editing, and deleting products with backend error handling.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Site settings editor allowing admins to update the shop logo with validation, previews, and backend update calls.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder user management page displaying a coming‑soon message.",
  "frontend/src/pages/CartPage.tsx": "Displays the user’s cart, handles quantity updates, and shows login or empty-cart states.",
  "frontend/src/pages/CatalogPage.tsx": "Renders product catalog with search, category, price, and sort filters synced to URL params.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with shipping form validation, cart summary, and order placement logic.",
  "frontend/src/pages/HomePage.tsx": "Home page showing banners, categories, and featured products with loading states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details with navigation to orders or home.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Customer orders page showing login gating, loading states, empty states, and a list of order summaries navigable to details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Displays detailed order info using fetched data, showing status, date, total, and item list.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows payment failure message with options to retry checkout or go home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays successful payment message and links to orders or home.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail view with stock info, add-to-cart, wishlist actions, and loading fallback.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page showing upcoming address management section.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Provides profile layout with tabs and access control, rendering nested profile routes.",
  "frontend/src/pages/profile/SettingsPage.tsx": "User settings page for theme toggle and language selection.",
  "frontend/src/pages/WishlistPage.tsx": "Displays user wishlist items or empty state, requiring login to access.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Detects backend unavailability patterns and formats user‑friendly error messages.",
  "frontend/src/utils/orderStatus.ts": "Maps order statuses to labels, colors, and provides full status list.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with extended colors, animations, plugins, and container settings.",
  "project_state.json": "Project metadata describing priorities, architecture, known issues, and existing features."
}