{
  "backend/main.mo": "Defines authorization mixin, ecommerce types, and in-memory state for users, products, categories, carts, orders, coupons, and site settings with initial health check and profile APIs.",
  "feature_evidence.json": "Describes feature verification evidence linking admin access behavior to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files covering routing, hooks, components, and feature integrations.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes with base styling overrides.",
  "frontend/index.html": "HTML entry point loading the root React app and setting the page title and favicon.",
  "frontend/README.md": "Documentation for setting up, running, and verifying the frontend with details on admin access, authentication, and Stripe setup.",
  "frontend/src/App.tsx": "Configures all customer and admin routes using TanStack Router with theme, i18n, and layout providers.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Modal dialog to add or edit categories with validation, backend mutation calls, and retry handling.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Form dialog for creating or editing products, including validation, category loading, and backend save with retry support.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "Admin interface to configure Stripe by submitting secret keys and allowed countries with status indicators.",
  "frontend/src/components/home/BannerCarousel.tsx": "Simple looping image carousel rendering static home page banners.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Displays a grid of category cards fetched from the backend with loading and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout including header, footer, document title setup, and identity loading gate.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright text and a referral link with branding.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, search, auth controls, cart count, theme and language options, and mobile menu.",
  "frontend/src/components/LoadingSkeletons.tsx": "Provides reusable skeleton loader components for product cards, grids, categories, and order rows using shadcn/ui primitives.",
  "frontend/src/components/product/ProductCard.tsx": "Product card showing image, price, stock status, and an add-to-cart action with authentication check.",
  "frontend/src/components/product/ProductImage.tsx": "Image component that falls back to a placeholder on missing or failed product image loads.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines reusable React Query cache keys for products, categories, user data, orders, and settings.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Provides admin-side queries and mutations for products and categories using the admin actor.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Checks backend health via admin actor and exposes status flags with periodic refetching.",
  "frontend/src/hooks/queries/useAuthz.ts": "Fetches the caller's user role and admin status using the authenticated actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Handles retrieving and mutating cart and wishlist data for authenticated users.",
  "frontend/src/hooks/queries/useCatalog.ts": "Public product and category query hooks using the authenticated actor.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all available coupons from the backend.",
  "frontend/src/hooks/queries/useOrders.ts": "Retrieves customer orders and individual order details with optional polling.",
  "frontend/src/hooks/queries/useReferrals.ts": "Loads referral user IDs for the authenticated user.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Queries and updates site settings, enforcing a fixed shop name and invalidating cache on change.",
  "frontend/src/hooks/queries/useStripe.ts": "Manages Stripe configuration queries and admin-side updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin-scoped actor for privileged operations.",
  "frontend/src/hooks/useDocumentTitle.ts": "Updates the browser document title with a provided value or default.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, state handling, and identity persistence.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes to get and set site theme and expose dark-mode status.",
  "frontend/src/i18n/index.tsx": "Provides translation context and English/Hindi dictionaries for UI strings and exposes a hook for lookup.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Provides category management with listing, adding, editing, deleting, and backend error handling.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Shows a simple coupon management page listing available coupons.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays basic admin dashboard metrics including orders, revenue, and product counts.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Defines the admin panel layout with sidebar navigation and backend health status indicators.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Empty admin login page placeholder.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Placeholder page for future order management features.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Supports product listing, searching, sorting, creating, editing, deleting, and backend error handling.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin page to load, preview, validate, and update site logo via data URL with error handling and toasts.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder admin users page showing a basic card and message that user management is coming soon.",
  "frontend/src/pages/CartPage.tsx": "Displays the user’s cart, calculates subtotal, and provides navigation to checkout or catalog.",
  "frontend/src/pages/CatalogPage.tsx": "Implements product browsing with filters, sorting, category selection, and URL-synced search.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows address, payment method selection, order summary, and simulates placing an order.",
  "frontend/src/pages/HomePage.tsx": "Renders homepage sections including banner, categories, and featured products with translations.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a confirmation message for a completed order and links to orders or home.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Displays a logged‑in user's orders with loading states, empty state, and navigation to order details.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Shows detailed information for a specific order including status, totals, and item list, with loading and missing‑order handling.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success message with buttons to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product information, handles add-to-cart and wishlist actions, and displays loading or not-found states.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Placeholder page stating address management features are coming soon.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Profile layout with tabs (overview, addresses, settings) and auth check before rendering nested content.",
  "frontend/src/pages/profile/SettingsPage.tsx": "User settings page allowing theme toggle and language selection.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's wishlist, handling login state, loading state, and empty wishlist scenarios.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Utility to detect backend unavailability errors (e.g., IC0508) and produce user‑friendly messages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and clearing them, supporting hash‑based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the current project state, priorities, architectural notes, and known issues, mainly focused on fixing admin panel access, backend failures, and restoring branding."
}