{
  "backend/main.mo": "Main backend canister defining types, authorization mixin, state maps, and initial user/profile/product/order logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components with test references.",
  "frontend-file-summaries.txt": "Pre-written summaries describing key responsibilities of various frontend React files, hooks, and components.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling rules.",
  "frontend/index.html": "Root HTML template for mounting the React app with cache-control headers and Vite entry script.",
  "frontend/README.md": "Frontend documentation explaining features, setup, admin access, authentication, Stripe config, and deployment checks.",
  "frontend/src/App.tsx": "Main application router configuring customer and admin routes with theme and translation providers.",
  "frontend/src/components/admin/CategoryEditorDialog.tsx": "Dialog for adding or editing categories with validation, backend error handling, and retry logic.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog for creating or updating products with form state, image upload handling, validation, and backend retry support.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "UI for configuring Stripe payments, including secret key and allowed countries, with validation and status display.",
  "frontend/src/components/home/BannerCarousel.tsx": "Carousel displaying rotating homepage banner images.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Renders a grid of category cards with loading skeletons and navigation to category-filtered catalog results.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapping header, footer, and routed content with initialization loading state.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright text and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Site header with branding, navigation, search, theme/language controls, cart status, and authentication handling.",
  "frontend/src/components/LoadingSkeletons.tsx": "Provides skeleton placeholder components for products, grids, categories, and order rows.",
  "frontend/src/components/product/ProductCard.tsx": "Displays a product card with image, price, stock status, and an add-to-cart button using React Query mutations.",
  "frontend/src/components/product/ProductImage.tsx": "Renders a product image with a fallback placeholder and error handling for invalid sources.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "Provides a mutation for placing orders and invalidates related queries on success.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines centralized React Query keys for products, categories, cart, user data, and admin data.",
  "frontend/src/hooks/queries/useAdminCatalog.ts": "Admin hooks for managing products and categories, including fetching and mutations with query invalidation.",
  "frontend/src/hooks/queries/useAdminHealthCheck.ts": "Runs periodic backend health checks using the admin actor and reports service status.",
  "frontend/src/hooks/queries/useAdminOrders.ts": "Admin hooks for fetching all orders and updating order status with related query invalidations.",
  "frontend/src/hooks/queries/useAuthz.ts": "Queries user role and admin status using the authenticated actor.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Provides queries and mutations for managing cart and wishlist, with authentication and backend-unavailability handling.",
  "frontend/src/hooks/queries/useCatalog.ts": "Queries public product and category data using optional filters.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all coupons using the authenticated actor.",
  "frontend/src/hooks/queries/useDashboardStats.ts": "Computes dashboard statistics by fetching admin order data and aggregating totals.",
  "frontend/src/hooks/queries/useOrders.ts": "Customer order queries for fetching all orders and individual order details with periodic polling.",
  "frontend/src/hooks/queries/useReferrals.ts": "Fetches referral data for the logged‑in user based on their principal.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Admin hooks to fetch and update site settings, enforcing a fixed shop name and invalidating queries on changes.",
  "frontend/src/hooks/queries/useStripe.ts": "Hooks using React Query to check Stripe setup status and update Stripe configuration via actor APIs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin-capable actor using a secret token and exposes fetch state.",
  "frontend/src/hooks/useDocumentTitle.ts": "Hook that sets the document title to a provided value or a default.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity login, identity persistence, and authentication state management.",
  "frontend/src/hooks/useTheme.ts": "Simplifies access to theme state and setters from next-themes.",
  "frontend/src/i18n/index.tsx": "Simple i18n context with English and Hindi translation dictionaries and utilities for accessing translations.",
  "frontend/src/index.css": "Tailwind CSS base styles with extensive custom themes for light and dark modes.",
  "frontend/src/main.tsx": "Root entry setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Provides an admin interface to list, add, edit, and delete categories with backend‑error detection and dialogs.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Displays coupon count using a query hook with loading state.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows admin stats for orders, revenue, and products with manual refresh capability.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Renders admin layout with sidebar navigation and backend health check indicator.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Provides an open-access admin login info page linking to the admin panel.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists orders with status updates, error handling, and loading states.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages products with search, sorting, editing, and deletion features.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Allows updating site settings including logo upload with validation and error handling.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder page indicating user management features will be added later.",
  "frontend/src/pages/CartPage.tsx": "Cart page displaying items, subtotal, and quantity controls, with identity checks and backend cart mutations.",
  "frontend/src/pages/CatalogPage.tsx": "Implements the catalog UI with category, price, search, and sort filters, syncing state with URL params and fetching filtered products.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form validation, cart summary, and order placement with redirects and error handling.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage sections including banners, categories, and featured products fetched from the catalog API.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details using the orderId param and provides navigation options.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Renders the user's orders page with login checks, loading skeletons, empty state, and a list of order cards.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Displays detailed information for a specific order, including status, date, total, and item list.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with actions to retry checkout or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a successful payment message with links to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Renders detailed product info with add‑to‑cart and wishlist actions, handling loading and missing products.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Shows a placeholder card indicating that address management is coming soon.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Provides the profile layout with authentication check and tabs for overview, addresses, and settings.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Offers UI for changing appearance theme and language preferences.",
  "frontend/src/pages/WishlistPage.tsx": "Displays the user's wishlist by matching wishlist IDs to products, handling auth, loading, and empty states.",
  "frontend/src/utils/backendAvailabilityErrors.ts": "Detects backend unavailability errors and formats user-friendly error messages.",
  "frontend/src/utils/orderStatus.ts": "Maps order status values to display labels, colors, and provides the list of all statuses.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling plugins.",
  "project_state.json": "Tracks project state, priorities to relax admin permission checks temporarily, architectural notes for a mobile app with backend services, and a list of deployment issues and existing features."
}