{
  "backend/main.mo": "Main Motoko canister implementing types, state, and logic for products, carts, orders, coupons, referrals, admin auth, and site settings.",
  "backend/migration.mo": "Migration module adding default site settings while preserving existing state during upgrades.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML template loading the React application root and entry script.",
  "frontend/README.md": "Project overview and development instructions for the ShopEase frontend.",
  "frontend/src/App.tsx": "Main React application routing setup including shopper routes and the full admin panel with site settings.",
  "frontend/src/components/admin/StripePaymentSetup.tsx": "UI for checking Stripe setup status and submitting secret key and allowed countries.",
  "frontend/src/components/home/BannerCarousel.tsx": "Renders a looping carousel of homepage banner images.",
  "frontend/src/components/home/CategoriesGrid.tsx": "Fetches and displays product categories in a grid with loading and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Top-level layout with header, footer, and initialization guard for identity.",
  "frontend/src/components/layout/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Main site header with navigation, search, theme/language toggles, auth handling, and cart count.",
  "frontend/src/components/LoadingSkeletons.tsx": "Skeleton-loading UI components for product cards, grids, categories, and order rows.",
  "frontend/src/components/product/ProductCard.tsx": "Card UI for a product with image, price, and add‑to‑cart functionality.",
  "frontend/src/components/product/ProductImage.tsx": "Displays a product image with fallback and error handling.",
  "frontend/src/hooks/queries/queryClientKeys.ts": "Defines React Query cache keys for products, cart, orders, and other resources.",
  "frontend/src/hooks/queries/useAuthz.ts": "Provides queries for checking user role, admin status, and verifying admin tokens.",
  "frontend/src/hooks/queries/useCartWishlist.ts": "Hooks for fetching cart/wishlist and adding items to the cart.",
  "frontend/src/hooks/queries/useCatalog.ts": "Hooks for fetching products and categories, with sample product migration fallback.",
  "frontend/src/hooks/queries/useCoupons.ts": "Fetches all available coupons via actor.",
  "frontend/src/hooks/queries/useOrders.ts": "Queries for fetching customer orders and polling a specific order.",
  "frontend/src/hooks/queries/useReferrals.ts": "Fetches referral user IDs for the authenticated user.",
  "frontend/src/hooks/queries/useSiteSettings.ts": "Provides React Query hooks to fetch and update site settings via an actor, invalidating the cache on updates.",
  "frontend/src/hooks/queries/useStripe.ts": "Defines hooks to check Stripe configuration status and set Stripe settings, with cache invalidation on updates.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor based on user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminActor.ts": "Initializes an anonymous admin actor for privileged operations and exposes loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useTheme.ts": "Wraps next-themes to expose theme value, setter, and dark-mode flag.",
  "frontend/src/i18n/index.tsx": "Implements a simple i18n context with English and Hindi translations for UI strings.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin view listing available categories with loading state.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Admin page displaying total coupons using coupon query with loading state.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing static metrics for orders, revenue, and products.",
  "frontend/src/pages/admin/AdminLayoutPage.tsx": "Admin layout that verifies admin token, redirects unauthorized users, provides sidebar navigation, and renders nested admin pages.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form that authenticates via backend, stores a session token, and redirects to the admin dashboard.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Placeholder page showing a basic layout for future admin order management features.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Product management page that filters, sorts, and lists products using catalog queries.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin page for editing shop name and logo with validation, preview, and save actions.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Placeholder page for upcoming admin user management features.",
  "frontend/src/pages/CartPage.tsx": "Renders the cart page, loading user cart data, showing items, summary, and navigating to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Implements product catalog with filters, sorting, and URL-synced search parameters, fetching products and categories.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with cart summary, payment method selection, and simulated order placement.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage sections including banners, categories, and featured products fetched from the catalog.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details using the order ID and navigation options.",
  "frontend/src/pages/orders/MyOrdersPage.tsx": "Displays a logged‑in customer's orders with status, navigation, and loading/empty states.",
  "frontend/src/pages/orders/OrderDetailsPage.tsx": "Shows details for a specific order including metadata, status, and item list.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays payment failure message with actions to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows payment success message and links to view orders or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with add-to-cart and wishlist actions, handling loading and missing products.",
  "frontend/src/pages/profile/AddressesPage.tsx": "Displays a card with a translated title and a placeholder message for upcoming address management.",
  "frontend/src/pages/profile/ProfileLayoutPage.tsx": "Provides the profile layout with tabs, requiring user identity and rendering nested profile pages.",
  "frontend/src/pages/profile/SettingsPage.tsx": "Renders appearance and language settings allowing toggling dark mode and selecting a language.",
  "frontend/src/pages/WishlistPage.tsx": "Shows the user's wishlist by matching stored product IDs with fetched products, with login and loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Describes current project state, goals, architectural notes, existing features, and known issues."
}