{
  "kind": "build_request",
  "title": "Disable backend admin-only authorization for /admin dashboard and redeploy with backend running",
  "projectName": "BISAULI Admin Dashboard",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-82",
      "text": "Remove/disable all backend \"admin-only\" permission checks that block the Admin Dashboard CRUD flows, so any caller (including anonymous) can add, update, and delete categories and products without receiving \"Unauthorized\" errors.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I am getting an 'Unauthorized: Only admins can add categories' error. Since I removed the login page, please disable all 'Admin-only' permission checks for the Dashboard. Make sure anyone who accesses the /admin URL has full permissions to add/delete categories and products."
        ]
      },
      "acceptanceCriteria": [
        "Calling `addCategory`, `updateCategory`, and `deleteCategory` succeeds from the admin UI without requiring any identity/admin role and without trapping with an \"Unauthorized\" message.",
        "Calling `addProduct`, `updateProduct`, and `deleteProduct` succeeds from the admin UI without requiring any identity/admin role and without trapping with an \"Unauthorized\" message.",
        "The specific trap text \"Unauthorized: Only admins can add categories\" is no longer possible from the current backend build."
      ]
    },
    {
      "id": "REQ-83",
      "text": "Align remaining Admin Dashboard backend APIs to not require admin authorization checks during this phase (so /admin pages do not break due to hidden admin-only guards), while keeping existing user-only checks for shopper features (cart/wishlist/profile/orders) intact.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "please disable all 'Admin-only' permission checks for the Dashboard."
        ]
      },
      "acceptanceCriteria": [
        "Admin-area operations used by existing /admin pages (e.g., coupons, order management placeholders, site settings, Stripe setup) do not fail due to backend `#admin` permission checks during this phase.",
        "Shopper/user-only operations (cart, wishlist, profile save, user referrals, and viewing personal orders) continue to enforce their existing user-level authorization checks (no new anonymous access granted)."
      ]
    },
    {
      "id": "REQ-84",
      "text": "Resolve the \"Canister is stopped\" (IC0508) failure mode for admin catalog mutations by ensuring the backend canister remains running and responsive during category/product CRUD, and ensure the backend health check can be used to confirm service availability.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also, fix the 'Canister is stopped' error by ensuring the backend is running."
        ]
      },
      "acceptanceCriteria": [
        "After deployment, calling the existing `healthCheck()` query returns the English text \"Running\".",
        "In the deployed environment, performing category/product CRUD from `/admin/categories` and `/admin/products` does not result in IC0508 \"Canister is stopped\" errors.",
        "If the backend becomes unavailable, the admin UI continues to show an English retryable error state (no blank screen / route-level crash)."
      ]
    },
    {
      "id": "REQ-85",
      "text": "Redeploy the application after implementing the backend authorization changes and backend availability fix, and verify that `/admin`, `/admin/categories`, and `/admin/products` allow full CRUD access without authentication.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Please redeploy now."
        ]
      },
      "acceptanceCriteria": [
        "In the redeployed build, a fresh browser session can open `/admin/categories`, create a category, edit it, and delete it without any login flow or \"Unauthorized\" errors.",
        "In the redeployed build, a fresh browser session can open `/admin/products`, create a product, edit it, and delete it without any login flow or \"Unauthorized\" errors.",
        "No admin-login route is required to perform the above actions."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko backend logic within the single actor in `backend/main.mo` (single-actor architecture).",
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify immutable frontend hook paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Use English for any user-facing text (including error messages)."
  ],
  "nonGoals": [
    "Do not add or reintroduce an admin login page, admin token flow, or Internet Identity requirement for /admin access during this phase.",
    "Do not change the shopper authentication model for user-only areas (cart/wishlist/profile/orders remain user-authenticated).",
    "Do not add new product features beyond fixing authorization, backend availability, and redeploy verification."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}