{
  "kind": "build_request",
  "title": "Restore product and category data display",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Verify and fix the data fetching for products in the backend main.mo getProducts() method to ensure it returns all stored products from the products HashMap",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Restore Data Connection: Reconnect the frontend to the 'products' and 'categories' database tables."
        ]
      },
      "acceptanceCriteria": [
        "The getProducts() method successfully returns all products stored in the backend",
        "Products are returned with all required fields (id, name, description, price, stock, category, imageUrl)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify and fix the data fetching for categories in the backend main.mo getCategories() method to ensure it returns all stored categories from the categories HashMap",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Restore Data Connection: Reconnect the frontend to the 'products' and 'categories' database tables."
        ]
      },
      "acceptanceCriteria": [
        "The getCategories() method successfully returns all categories stored in the backend",
        "Categories are returned with all required fields (id, name, imageUrl)"
      ]
    },
    {
      "id": "REQ-3",
      "text": "If the products HashMap is empty, populate it with sample products including at least one product in the 'Mobiles' category with realistic data (name, description, price, stock, imageUrl)",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Check Table Status: If the tables are empty, please restore the sample products/ categories we had earlier (like 'Mobiles')."
        ]
      },
      "acceptanceCriteria": [
        "At least 3-5 sample products are created if products HashMap is empty",
        "Sample products include realistic mobile phone products with prices between 10,000-50,000",
        "All sample products have valid imageUrl values (placeholder or real product images)"
      ]
    },
    {
      "id": "REQ-4",
      "text": "If the categories HashMap is empty, populate it with sample categories including 'Mobiles' and at least 2-3 other relevant e-commerce categories (e.g., 'Electronics', 'Fashion', 'Home & Kitchen')",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Check Table Status: If the tables are empty, please restore the sample products/ categories we had earlier (like 'Mobiles')."
        ]
      },
      "acceptanceCriteria": [
        "'Mobiles' category is created with a valid imageUrl",
        "At least 3-4 total categories exist after initialization",
        "Each category has a meaningful name and appropriate imageUrl"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Ensure the HomePage's Featured Products section (first 8 products) successfully fetches and displays products using the useGetProducts hook",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Visibility: Ensure the 'Featured Products' and 'Shop by Category' sections on the home page are fetching data correctly now."
        ]
      },
      "acceptanceCriteria": [
        "Featured Products section displays up to 8 product cards on the home page",
        "Product cards show product images, names, prices, and add-to-cart buttons",
        "Loading states and error handling work correctly"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the HomePage's Shop by Category section successfully fetches and displays all categories using the useGetCategories hook",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "Visibility: Ensure the 'Featured Products' and 'Shop by Category' sections on the home page are fetching data correctly now."
        ]
      },
      "acceptanceCriteria": [
        "Shop by Category section displays all available categories in a grid",
        "Category cards show category images and names",
        "Clicking a category navigates to the catalog page filtered by that category"
      ]
    }
  ],
  "constraints": [
    "Preserve the admin login credentials (username: Prashant, password: Prashant80061)",
    "Do not modify the authentication or authorization system",
    "Maintain the existing single-actor backend architecture"
  ],
  "nonGoals": [
    "Changing the admin authentication mechanism",
    "Modifying the UI design or layout of existing pages",
    "Adding new product or category management features",
    "Implementing data persistence migrations"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}