{
  "kind": "build_request",
  "title": "Remove all remaining Admin permission checks to unblock Orders/Categories/Products",
  "projectName": "BISAULI ShopEase",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-121",
      "text": "Remove all backend admin-only permission checks that can cause 'Unauthorized', 'No Permission', or 'You do not have permission' failures for Admin functionality, so any caller (including anonymous) can view and manage Orders, Categories, Products, Coupons, Site Settings, and Stripe setup during the open-admin phase.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "PLEASE REMOVE ALL PERMISSION CHECKS from the entire Admin folder immediately. I should be able to see Orders, add Categories, and edit Products without any 'Unauthorized' or 'No Permission' popups. Make the access completely open for me."
        ]
      },
      "acceptanceCriteria": [
        "Calling admin-used backend methods no longer traps due to AccessControl admin permission checks (e.g., `getAllOrders`, `updateOrderStatus`, `addCategory`, `updateCategory`, `deleteCategory`, `addProduct`, `updateProduct`, `deleteProduct`, `updateSiteSettings`, `addCoupon`, `deleteCoupon`, `setStripeConfiguration`).",
        "Admin Orders page can fetch orders and update an order’s status without receiving any authorization-related errors from the backend.",
        "Admin Categories CRUD and Admin Products CRUD succeed without any authorization-related errors from the backend.",
        "User-only shopper flows (cart/wishlist/place order/my orders) remain protected and continue to require user permission checks as they do today."
      ]
    },
    {
      "id": "REQ-122",
      "text": "Remove all frontend-side permission checks / role gating / admin-authorization UI blocks within `frontend/src/pages/admin/**`, `frontend/src/components/admin/**`, and admin query/mutation hooks so Admin pages never show 'Unauthorized' / 'No Permission' popups and never block actions due to permission state during the open-admin phase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "PLEASE REMOVE ALL PERMISSION CHECKS from the entire Admin folder immediately.",
          "I should be able to see Orders, add Categories, and edit Products without any 'Unauthorized' or 'No Permission' popups."
        ]
      },
      "acceptanceCriteria": [
        "Visiting `/admin/orders`, `/admin/categories`, and `/admin/products` does not trigger any frontend permission gate, access denied screen, or permission-based toast/dialog.",
        "Admin actions (add/edit/delete category, add/edit/delete product, update order status) do not display any permission-related error messages; only real backend unavailability/validation errors are shown.",
        "Any existing admin UI copy that says the user lacks permission (e.g., 'You do not have permission to delete categories right now...') is removed or replaced with neutral, English error handling that does not reference permissions."
      ]
    },
    {
      "id": "REQ-123",
      "text": "Ensure Admin Orders data loading and status update flows use the anonymous/admin actor path consistently (no Internet Identity role checks) and that errors are surfaced as clear English operational messages (backend unavailable, validation, not found) rather than permission messaging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I get a 'You do not have permission' error when trying to view or manage Orders."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/hooks/queries/useAdminOrders.ts` continues to call the backend using `useAdminActor()` and does not depend on any authenticated/II-bound actor or role-check hooks.",
        "When backend calls fail, the Admin Orders page shows clear English error output via existing formatting utilities, and does not show permission-related text.",
        "With a running backend, the Admin Orders table renders without errors and the status dropdown successfully updates status and refreshes the list."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no new backend services).",
    "Do not edit any files under `frontend/src/components/ui` (read-only components must be composed).",
    "Do not modify immutable frontend paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`).",
    "Use English for all user-facing text changed/added by this work."
  ],
  "nonGoals": [
    "Do not add new authentication methods or reintroduce admin login for this phase.",
    "Do not change data schemas or require a state migration unless strictly necessary for this permission-removal work.",
    "Do not remove or weaken shopper/user permission checks for non-admin customer features (cart, wishlist, placing orders, viewing personal orders)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}