{
  "kind": "build_request",
  "title": "Add image upload for Categories and render modern category cards on Home",
  "projectName": "BISAULI Shop",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-144",
      "text": "Extend the backend Category model to store an uploaded category image as a Text field (Data URL or URL string) and return it from category queries.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In the Admin Panel, when I create or edit a category, let me upload a Category Image.",
          "On the main shop page, instead of just a box, show the uploaded image for each category"
        ]
      },
      "acceptanceCriteria": [
        "`backend/main.mo` `Category` type includes a new `imageUrl : Text` field.",
        "`getCategories()` returns categories including `imageUrl`.",
        "Category image data is persisted in the existing categories storage so that after creating/updating a category image, reloading the app still shows the same image.",
        "If `imageUrl` is empty, the backend still returns the category successfully (no traps due to missing image)."
      ]
    },
    {
      "id": "REQ-145",
      "text": "Update backend category CRUD methods to accept and persist the Category image field when creating and editing categories.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In the Admin Panel, when I create or edit a category, let me upload a Category Image."
        ]
      },
      "acceptanceCriteria": [
        "`addCategory` persists the provided `imageUrl` (if any) for the created category.",
        "`updateCategory` persists the provided `imageUrl` changes for the specified category.",
        "Existing UI flows that call `addCategory` / `updateCategory` continue to work after the interface change (types align between backend Candid and frontend generated types)."
      ]
    },
    {
      "id": "REQ-146",
      "text": "Add a Category Image file upload control with preview to the Admin Category create/edit dialog, storing the selected image in form state as a Data URL string and saving it via the existing category create/update mutations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "In the Admin Panel, when I create or edit a category, let me upload a Category Image."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/admin/CategoryEditorDialog.tsx` includes an image file input (accepting images) for both Add and Edit flows.",
        "When an admin selects an image file, the dialog shows an inline preview before saving.",
        "The selected image is converted to a Data URL string and sent in the category payload when saving.",
        "If a non-image file is selected, show a clear English validation error and do not set the image.",
        "Provide a clear/remove action to unset a selected image before saving.",
        "All user-facing labels, helper text, and validation errors in this dialog are in English."
      ]
    },
    {
      "id": "REQ-147",
      "text": "Display the uploaded category image on the shopper Home page category grid instead of the current placeholder icon box, and style category cards to look modern and professional.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "On the main shop page, instead of just a box, show the uploaded image for each category (like a picture of a shirt for 'Cloths').",
          "Make the category cards look modern and professional with the image in the background or top."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/home/CategoriesGrid.tsx` renders category cards using the category’s `imageUrl` when present.",
        "Category cards have a modern/professional look (e.g., image at top or as a background with readable overlay text), with hover/focus styling preserved.",
        "If a category has no image, render a clean fallback (do not show a broken image).",
        "Category card click behavior remains unchanged (navigates to `/catalog` with the category filter).",
        "The category grid remains responsive across mobile and desktop."
      ]
    },
    {
      "id": "REQ-148",
      "text": "Show a small image thumbnail in the Admin Categories list so admins can verify which image is attached to each category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want to add an image upload option for each Category."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/pages/admin/AdminCategoriesPage.tsx` shows a thumbnail column (or equivalent) for each category when `imageUrl` is present.",
        "If `imageUrl` is empty, show an English fallback indicator (e.g., 'No image') without breaking the table layout.",
        "The page remains stable with loading/empty/error states and does not crash when images fail to load."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or any other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not add backend image storage; store category images as a Text string (Data URL or URL) in the Category record, consistent with existing product/site-logo image patterns.",
    "Use English for all user-facing text added or changed as part of this request."
  ],
  "nonGoals": [
    "Implementing image resizing/compression pipelines or external image hosting.",
    "Changing shopper Catalog filtering behavior beyond using the category cards as navigation.",
    "Adding new authentication/authorization flows for admin beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}