{
  "kind": "build_request",
  "title": "Convert BISAULI Store to a PWA (Manifest, Service Worker, A2HS prompt, Offline)",
  "projectName": "BISAULI Store",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-153",
      "text": "Add a Web App Manifest for the BISAULI Store and wire it into the app so browsers recognize the site as installable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want to convert this website into a PWA (Progressive Web App). Please:\n\n1. Add a Web App Manifest and Service Worker."
        ]
      },
      "acceptanceCriteria": [
        "A valid manifest file exists under the frontend static/public assets (e.g., `frontend/public/manifest.webmanifest` or equivalent) and is served by the app.",
        "`frontend/index.html` includes a `<link rel=\"manifest\" ...>` pointing to the manifest.",
        "The manifest includes: name/short_name set to BISAULI, start_url, display=standalone, background_color, theme_color, and a set of icons (including 192x192 and 512x512).",
        "In Chrome DevTools > Application > Manifest, the manifest loads without errors."
      ]
    },
    {
      "id": "REQ-154",
      "text": "Add a Service Worker that enables offline support (app shell caching) and faster repeat loads, and ensure it is registered by the app at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1. Add a Web App Manifest and Service Worker.",
          "4. Make it work offline and ensure it loads fast like a native app."
        ]
      },
      "acceptanceCriteria": [
        "A service worker file exists under frontend static/public assets (e.g., `frontend/public/sw.js`) and is served by the app.",
        "The service worker is registered on app load without requiring edits to immutable `frontend/src/main.tsx` (registration can be done via `frontend/index.html` and/or non-immutable React components).",
        "First visit online caches the core app shell assets needed to render the UI on subsequent visits.",
        "When the browser is set to Offline and the user reloads, the app still loads a usable offline experience (at minimum: shell + a clear offline message for data that cannot be fetched).",
        "In Chrome DevTools > Application > Service Workers, the service worker is installed/activated successfully and controls the page after reload."
      ]
    },
    {
      "id": "REQ-155",
      "text": "Implement an Add-to-Home-Screen (A2HS) install prompt experience for mobile users that shows a user-friendly English popup/banner when installation is available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ensure that when a customer opens the site on mobile, they see an 'Add to Home Screen' popup."
        ]
      },
      "acceptanceCriteria": [
        "On supported mobile browsers (e.g., Android Chrome) where `beforeinstallprompt` is available, a visible in-app prompt appears after page load (or after a short delay) with clear English text and an Install/Add action.",
        "Tapping the Install/Add action triggers the browser install prompt (using the captured `beforeinstallprompt` event).",
        "The prompt includes a Dismiss/Not now action and does not reappear continuously in the same session after dismissal.",
        "On iOS Safari (where `beforeinstallprompt` is not available), show an English informational prompt with simple steps (e.g., “Tap Share, then ‘Add to Home Screen’.”) and allow dismissing it."
      ]
    },
    {
      "id": "REQ-156",
      "text": "Use the existing BISAULI logo as the PWA app icon set (including standard and maskable icons), and ensure the icons are referenced correctly by the manifest.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use my BISAULI logo as the app icon."
        ]
      },
      "acceptanceCriteria": [
        "A complete set of PWA icon PNGs is available as static frontend assets and referenced in the manifest (at minimum: 192x192 and 512x512; plus maskable variants).",
        "The icons visually reflect the BISAULI logo and render crisply at small sizes.",
        "Chrome DevTools manifest preview shows the correct icon and no icon-related warnings (including maskable warnings if maskable icons are provided)."
      ]
    },
    {
      "id": "REQ-157",
      "text": "Ensure the PWA offline/fast-loading behavior is reliable and does not break core navigation: implement a clear caching strategy and include an offline fallback for navigation when the network is unavailable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it work offline and ensure it loads fast like a native app."
        ]
      },
      "acceptanceCriteria": [
        "Service worker caching strategy avoids trapping the app in a broken state after deployments (e.g., supports updating to new versions cleanly).",
        "A dedicated offline fallback page or UI state exists and uses English user-facing text (e.g., “You are offline. Some features may be unavailable.”).",
        "Core route navigation loads the cached app shell quickly on repeat visits, with noticeably reduced load time vs. a cold load.",
        "The service worker does not cache backend canister errors as successful responses (i.e., it should not permanently serve an error page as the cached content)."
      ]
    },
    {
      "id": "REQ-158",
      "text": "Update project documentation to include basic PWA testing steps (manifest, service worker, offline test, install prompt test) using English instructions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I want to convert this website into a PWA (Progressive Web App)."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/README.md` (or an appropriate existing doc) includes a short “PWA” section with steps to: verify manifest, verify service worker registration, test offline mode, and test installation/A2HS on mobile.",
        "Documentation uses English user-facing text and does not reference unsupported tooling or stacks."
      ]
    }
  ],
  "constraints": [
    "Do not edit any paths listed as immutable, including `frontend/src/main.tsx` and `frontend/src/hooks/useActor.ts` (service worker registration must be implemented without modifying immutable paths).",
    "Keep backend architecture unchanged (single Motoko actor). No backend changes are required for PWA enablement.",
    "All user-facing text introduced by the PWA install/offline UI must be in English."
  ],
  "nonGoals": [
    "Implementing push notifications (not requested here).",
    "Adding third-party analytics or external monitoring for PWA usage.",
    "Building a fully offline-capable e-commerce experience that supports placing orders while offline (offline support here is for app shell + graceful offline messaging)."
  ],
  "imageRequirements": {
    "required": [
      "Square app icon based on the BISAULI logo (pwa-icon.dim_192x192.png)",
      "Square app icon based on the BISAULI logo (pwa-icon.dim_512x512.png)",
      "Maskable square app icon based on the BISAULI logo (pwa-icon-maskable.dim_192x192.png)",
      "Maskable square app icon based on the BISAULI logo (pwa-icon-maskable.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}