{
  "kind": "build_request",
  "title": "Disable Internet Identity for /admin and use username/password-only admin login",
  "projectName": "ShopEase",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-47",
      "text": "Remove all Internet Identity (II) requirements from the admin login experience so that the /admin area does not require an Internet Identity session to log in or to access the dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please completely disable Internet Identity for the /admin route. Make it a simple login page that only asks for a username and password."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin/login shows only a username and password form (no Internet Identity button, no “Step 1: Internet Identity” text, and no Principal ID display).",
        "Submitting the form does not check for the presence of an Internet Identity identity object before calling the backend login API.",
        "All user-facing text on the admin login page is in English."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Set the admin credentials to username \"admin\" and password \"Admin@123\" and ensure these credentials successfully authenticate immediately after deployment.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Set the username to admin and password to Admin@123."
        ]
      },
      "acceptanceCriteria": [
        "Logging in at /admin/login with username \"admin\" and password \"Admin@123\" succeeds and navigates to /admin.",
        "Logging in with any other username/password fails with an English error message indicating invalid credentials (no mention of Internet Identity)."
      ]
    },
    {
      "id": "REQ-49",
      "text": "Update admin route gating so that access to /admin and all nested admin routes is controlled only by the admin session/token state (and optional backend token validation), and does not depend on the caller Principal ID or Internet Identity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Ensure that no Principal ID check is required to see the dashboard."
        ]
      },
      "acceptanceCriteria": [
        "A user can access /admin (dashboard) after a successful username/password login even when not logged into Internet Identity.",
        "AdminLayoutPage does not call Principal-based admin checks (e.g., caller Principal admin status) as the primary gating mechanism; it gates based on presence/validity of the stored admin token.",
        "If the admin token is missing/invalid, /admin routes redirect to /admin/login."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Implement backend admin authentication that does not depend on the caller being non-anonymous, and issue/track an admin token that can be used to authorize admin-only operations without requiring Internet Identity.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please completely disable Internet Identity for the /admin route. Make it a simple login page that only asks for a username and password."
        ]
      },
      "acceptanceCriteria": [
        "The backend adminLogin method accepts username/password and returns an admin token string on success without requiring Internet Identity (no rejection solely because the caller is anonymous).",
        "The backend provides a way for the frontend to validate whether an admin token is currently authorized (e.g., a validate method returning boolean).",
        "Admin-only backend operations can be authorized using the issued admin token via the project’s existing access-control initialization path (e.g., actor secret initialization), without requiring the caller Principal to be registered as admin."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Update the admin frontend to create/use a backend actor for admin pages that applies the stored admin token even when the user is not logged in with Internet Identity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Please completely disable Internet Identity for the /admin route."
        ]
      },
      "acceptanceCriteria": [
        "Admin pages can successfully call admin-only backend methods after username/password login even when there is no Internet Identity session.",
        "The implementation does not require editing the immutable frontend hook files listed in system constraints (a safe alternative approach is used for admin-specific actor creation)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (immutable paths).",
    "Use English for all user-facing admin text related to this change."
  ],
  "nonGoals": [
    "Do not remove or change Internet Identity authentication for shopper/user flows outside /admin.",
    "Do not add third-party authentication providers for admin (no OAuth, no Internet Identity for admin).",
    "Do not introduce external databases or backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}