{
  "kind": "build_request",
  "title": "Disable all admin auth and force persistent BISAULI branding",
  "projectName": "BISAULI Store",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-63",
      "text": "Remove all admin route protection so the /admin dashboard and all nested admin routes are directly accessible without any username/password, token, or redirects to /admin/login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want you to completely REMOVE the admin login page and all password protection for now. Just let me access the /admin dashboard directly without any username or password."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin in a fresh browser session (no stored session params) loads the AdminLayoutPage + AdminDashboardPage without showing any login screen.",
        "Visiting /admin/products, /admin/categories, /admin/orders, /admin/users, /admin/coupons, /admin/site-settings, and /admin/stripe-setup loads the respective admin pages without requiring any session token.",
        "AdminLayoutPage no longer reads, verifies, stores, clears, or depends on the session parameter 'caffeineAdminToken'.",
        "No automatic navigation to /admin/login occurs from any admin route due to missing/invalid token."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Completely remove the Admin Login page from the app routing and UI entry points so /admin/login is not used for access during this phase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I want you to completely REMOVE the admin login page and all password protection for now."
        ]
      },
      "acceptanceCriteria": [
        "The /admin/login route is removed from the router configuration in frontend/src/App.tsx (no route registration).",
        "No admin page links or buttons navigate users to /admin/login.",
        "If a user manually navigates to /admin/login, the app does not present a working login flow (either 404/not-found behavior from the router or a redirect to /admin).",
        "All user-facing text related to admin username/password login is removed from the UI."
      ]
    },
    {
      "id": "REQ-65",
      "text": "Temporarily disable backend admin authorization checks for admin-only operations so the admin UI functions can be used without any authentication, including: product mutations, category mutations, coupon mutations, order status updates, stripe configuration updates, and site settings updates.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "completely REMOVE the admin login page and all password protection for now"
        ]
      },
      "acceptanceCriteria": [
        "Admin UI actions that previously required admin privileges (e.g., add/update/delete product; update site settings) succeed when called from an unauthenticated/anonymous actor.",
        "backend/main.mo no longer traps with \"Unauthorized: Only admins ...\" for the admin-only methods during this temporary no-auth phase.",
        "No admin token is required for calling verifyAdminToken/adminAuthenticate to make admin UI functional (these can be left unused or made no-op, but must not be required for admin flows)."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Permanently enforce the site/shop name as \"BISAULI\" so it does not revert to \"Canfinity Store\" after deployment or canister upgrades, while still allowing reading site settings from the backend.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Also, permanently change the site name to BISAULI."
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo returns site settings with shopName exactly \"BISAULI\" when getSiteSettings() is called after deployment.",
        "After a canister upgrade/redeploy, the effective shop name still remains \"BISAULI\" (no reversion to \"Canfinity Store\").",
        "The shopper UI header and document title continue to display \"BISAULI\" based on loaded site settings (AppLayout uses siteSettings.shopName).",
        "No user-facing text shows \"Canfinity Store\" anywhere in the app after the change."
      ]
    },
    {
      "id": "REQ-67",
      "text": "Redeploy the application after implementing these changes and provide the production/draft URLs for direct access to /admin and the main site.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Do it now and provide the link."
        ]
      },
      "acceptanceCriteria": [
        "A working deployed URL is provided for the main site root route (/).",
        "A working deployed URL is provided for the admin dashboard route (/admin) that loads without login."
      ]
    }
  ],
  "constraints": [
    "Frontend: do not edit files under frontend/src/components/ui (compose only).",
    "Frontend: do not modify immutable paths listed in SYSTEM_CONTEXT.",
    "Backend: keep all Motoko logic in the single actor in backend/main.mo; only add backend/migration.mo if required for state upgrade compatibility."
  ],
  "nonGoals": [
    "Do not implement or fix the admin username/password login flow in this change (it is intentionally removed/disabled).",
    "Do not add new product features unrelated to removing admin auth and enforcing the BISAULI branding.",
    "Do not introduce any external authentication providers or databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}