{
  "kind": "build_request",
  "title": "Add Admin Site Settings (Shop Name + Logo) and verify admin login credentials",
  "projectName": "ShopEase",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-52",
      "text": "Add backend support for site-wide branding settings by introducing a persisted Site Settings record that stores (1) Shop Name (Text) and (2) Logo (Text, stored as a data URL string or a plain URL string). Provide backend methods to read and update these settings, where updates are admin-only.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Now, please add a 'Site Settings' tab in the admin dashboard where I can change the Shop Name and upload a new Logo."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to fetch current Site Settings (Shop Name + Logo) without trapping for normal app usage.",
        "Backend exposes an admin-only method to update Shop Name and Logo in Site Settings.",
        "Site Settings values persist across page refreshes and subsequent reads after being updated."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Ensure the admin login flow succeeds with username \"admin\" and password \"Admin@123\" using the existing Admin Login UI (`frontend/src/pages/admin/AdminLoginPage.tsx`) and the backend `adminAuthenticate(username, password)` method, without requiring Internet Identity for admin access.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Also, confirm that I can finally log in with admin / Admin@123 without any errors."
        ]
      },
      "acceptanceCriteria": [
        "From `/admin/login`, submitting username `admin` and password `Admin@123` successfully returns a token from `adminAuthenticate` and navigates to `/admin`.",
        "Admin routes under `/admin/*` remain accessible for the session after login due to token storage under the session key `caffeineAdminToken` and successful `verifyAdminToken` checks in `frontend/src/pages/admin/AdminLayoutPage.tsx`.",
        "If invalid credentials are entered, the UI shows the existing English error message behavior (e.g., \"Invalid username or password\")."
      ]
    },
    {
      "id": "REQ-54",
      "text": "Add a new Admin page for \"Site Settings\" and add it as a new navigation item (tab/link) in the Admin sidebar (`frontend/src/pages/admin/AdminLayoutPage.tsx`) so admins can open it from the admin dashboard area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "add a 'Site Settings' tab in the admin dashboard"
        ]
      },
      "acceptanceCriteria": [
        "Admin sidebar includes a new navigation item labeled \"Site Settings\" (English) and it routes to a new admin nested route (e.g., `/admin/site-settings`).",
        "The new route renders a dedicated Site Settings page component under the admin layout (`AdminLayoutPage`).",
        "The Site Settings page is protected by the same admin-token gating already used for other admin pages (i.e., cannot be accessed without a valid `caffeineAdminToken`)."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Implement the Admin \"Site Settings\" page UI to (1) edit Shop Name, (2) upload/select a new Logo image file, (3) preview the chosen logo before saving, and (4) save changes to the backend. Use English for all labels, helper text, and validation messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "where I can change the Shop Name and upload a new Logo"
        ]
      },
      "acceptanceCriteria": [
        "Site Settings page displays a \"Shop Name\" text input and a \"Logo\" file input (accepting common image formats).",
        "When an image file is selected, a visible preview is shown on the page before saving.",
        "Clicking \"Save\" updates the backend Site Settings and shows a clear success confirmation in English; subsequent reload of the page shows the updated Shop Name and Logo preview.",
        "If Shop Name is empty when saving, the page shows an English validation error and does not call the backend update method."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Reflect the configured branding on the shopper UI by rendering the saved Shop Name and Logo in the main shopper header (`frontend/src/components/layout/Header.tsx`) in place of the hard-coded ShopEase logo assets when Site Settings are present.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "change the Shop Name and upload a new Logo"
        ]
      },
      "acceptanceCriteria": [
        "When Site Settings has a logo value, the Header renders that logo instead of the static `/assets/generated/shopease-logo...` images.",
        "When Site Settings has a shop name value, the Header uses it as the logo alt text and/or visible shop title (English).",
        "If Site Settings is not configured yet, the existing generated ShopEase logo behavior remains as a fallback."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything under `frontend/src/components/ui`; compose these components instead.",
    "Do not add backend image storage; logo must be stored as text (e.g., data URL) or referenced by URL, and served/used by the frontend accordingly."
  ],
  "nonGoals": [
    "Do not add multi-tenant settings, per-user branding, or theme customization beyond Shop Name and Logo.",
    "Do not implement advanced media processing (cropping, resizing on backend) beyond basic client-side preview and upload handling.",
    "Do not introduce third-party authentication providers or remove shopper Internet Identity authentication (only admin flow must work as specified)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}