{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Open-admin phase: remove all frontend admin permission gating and sanitize permission error copy",
  "requirements": [
    {
      "id": "REQ-122",
      "summary": "Remove frontend-side permission checks/role gating and eliminate permission-based UI blocks/messages across Admin pages, Admin components, and Admin hooks.",
      "acceptanceCriteria": [
        "Visiting `/admin/orders`, `/admin/categories`, and `/admin/products` does not trigger any frontend permission gate, access denied screen, or permission-based toast/dialog.",
        "Admin actions (add/edit/delete category, add/edit/delete product, update order status) do not display any permission-related error messages; only real backend unavailability/validation errors are shown.",
        "Any existing admin UI copy that says the user lacks permission (e.g., 'You do not have permission to delete categories right now...') is removed or replaced with neutral, English error handling that does not reference permissions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminCategoriesPage.tsx",
          "operation": "modify",
          "description": "Remove any permission/role-based UI blocking and replace permission-referencing error copy (e.g., delete failure messages) with neutral operational error handling that does not mention authorization."
        },
        {
          "path": "frontend/src/components/admin/CategoryEditorDialog.tsx",
          "operation": "modify",
          "description": "Remove permission-specific messaging branches (e.g., checks for 'permission' in error messages) and ensure errors are shown as neutral operational messages (validation/backend unavailable/retryable) without referencing permissions."
        },
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Ensure product CRUD errors never surface permission-based text; keep only neutral operational errors and avoid any role/permission UI gating during the open-admin phase."
        },
        {
          "path": "frontend/src/components/admin/ProductEditorDialog.tsx",
          "operation": "modify",
          "description": "Ensure add/update product flow never shows permission-related text and does not block actions due to permission state; keep validation errors and backend unavailable messaging only."
        },
        {
          "path": "frontend/src/hooks/queries/useAuthz.ts",
          "operation": "modify",
          "description": "Remove or neutralize admin-role/permission gating usage for admin UI during the open-admin phase (so admin pages/components do not rely on role checks to render/enable actions)."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Remove any Admin navigation gating or permission-based UI blocks that prevent reaching admin pages during the open-admin phase (do not add authentication)."
        },
        {
          "path": "frontend/src/utils/backendAvailabilityErrors.ts",
          "operation": "modify",
          "description": "Sanitize formatted error output so any Unauthorized/No Permission-style backend errors (or similar strings) are converted into neutral English operational messages that do not reference permissions, while preserving backend unavailable/validation/not-found clarity."
        }
      ]
    },
    {
      "id": "REQ-123",
      "summary": "Ensure Admin Orders uses the anonymous admin actor consistently and surfaces clear operational errors (not permission messaging) for load and status updates.",
      "acceptanceCriteria": [
        "`frontend/src/hooks/queries/useAdminOrders.ts` continues to call the backend using `useAdminActor()` and does not depend on any authenticated/II-bound actor or role-check hooks.",
        "When backend calls fail, the Admin Orders page shows clear English error output via existing formatting utilities, and does not show permission-related text.",
        "With a running backend, the Admin Orders table renders without errors and the status dropdown successfully updates status and refreshes the list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useAdminOrders.ts",
          "operation": "modify",
          "description": "Verify Admin Orders query/mutation exclusively uses `useAdminActor()` (no II/role-check dependencies) and align thrown/returned errors so they are operational (e.g., backend unavailable) rather than permission-oriented."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrdersPage.tsx",
          "operation": "modify",
          "description": "Ensure load/update error rendering and toasts use clear English operational messaging (via existing formatting utilities) and never display permission-related text."
        },
        {
          "path": "frontend/src/utils/backendAvailabilityErrors.ts",
          "operation": "modify",
          "description": "Adjust shared error formatting used by Admin Orders so authorization-like failures never render permission text, while still clearly communicating backend unavailable, validation errors, and not-found conditions."
        }
      ]
    }
  ]
}