{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Category image upload in Admin + modern category image cards on Home",
  "requirements": [
    {
      "id": "REQ-146",
      "summary": "Add category image upload (Data URL) with preview + remove action to the Admin Category create/edit dialog and persist via existing save mutations.",
      "acceptanceCriteria": [
        "`frontend/src/components/admin/CategoryEditorDialog.tsx` includes an image file input (accepting images) for both Add and Edit flows.",
        "When an admin selects an image file, the dialog shows an inline preview before saving.",
        "The selected image is converted to a Data URL string and sent in the category payload when saving.",
        "If a non-image file is selected, show a clear English validation error and do not set the image.",
        "Provide a clear/remove action to unset a selected image before saving.",
        "All user-facing labels, helper text, and validation errors in this dialog are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/CategoryEditorDialog.tsx",
          "operation": "modify",
          "description": "Extend dialog form state to include `imageUrl`, add an image-only file input with validation (reject non-images with an English error), convert the selected file to a Data URL via FileReader, render an inline preview, and add a clear/remove action; include `imageUrl` in the category payload for both add and update saves."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the frontend-generated `Category` type to use the new `imageUrl: string` field (and adjust/remove any old image field) so CategoryEditorDialog can submit the image consistently with the backend interface."
        },
        {
          "path": "frontend/src/hooks/queries/useAdminCatalog.ts",
          "operation": "modify",
          "description": "Align admin category mutation hook typings and payload construction with the updated `Category` type that includes `imageUrl`, ensuring add/update calls accept and send the image field without breaking existing flows."
        }
      ]
    },
    {
      "id": "REQ-147",
      "summary": "Render shopper Home category cards using uploaded category images and update styling to a modern, responsive card layout with proper fallbacks.",
      "acceptanceCriteria": [
        "`frontend/src/components/home/CategoriesGrid.tsx` renders category cards using the category’s `imageUrl` when present.",
        "Category cards have a modern/professional look (e.g., image at top or as a background with readable overlay text), with hover/focus styling preserved.",
        "If a category has no image, render a clean fallback (do not show a broken image).",
        "Category card click behavior remains unchanged (navigates to `/catalog` with the category filter).",
        "The category grid remains responsive across mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/category/CategoryImage.tsx",
          "operation": "create",
          "description": "Create a reusable CategoryImage renderer that accepts `imageUrl` and `alt`, uses a clean fallback when empty, and handles image load failures without showing broken images (e.g., fallback to `frontend/public/assets/generated/product-placeholder.dim_800x800.png`)."
        },
        {
          "path": "frontend/src/components/home/CategoriesGrid.tsx",
          "operation": "modify",
          "description": "Replace the placeholder icon box with modern category cards that display the category image via the new `CategoryImage` component, using `category.imageUrl` when available; keep click navigation to `/catalog` with category filter unchanged and maintain responsive grid + hover/focus styling."
        },
        {
          "path": "frontend/src/hooks/queries/useCatalog.ts",
          "operation": "modify",
          "description": "Ensure the shopper categories query typing aligns with the updated `Category` type (including `imageUrl`) so the Home categories grid can safely render images."
        }
      ]
    },
    {
      "id": "REQ-148",
      "summary": "Show category image thumbnails in the Admin Categories list with a stable layout and robust fallbacks.",
      "acceptanceCriteria": [
        "`frontend/src/pages/admin/AdminCategoriesPage.tsx` shows a thumbnail column (or equivalent) for each category when `imageUrl` is present.",
        "If `imageUrl` is empty, show an English fallback indicator (e.g., 'No image') without breaking the table layout.",
        "The page remains stable with loading/empty/error states and does not crash when images fail to load."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminCategoriesPage.tsx",
          "operation": "modify",
          "description": "Add a thumbnail column to the categories table that renders a small preview using the shared `CategoryImage` component when `imageUrl` is present; otherwise show an English 'No image' indicator, and ensure failed image loads fall back without breaking layout or crashing."
        },
        {
          "path": "frontend/src/components/category/CategoryImage.tsx",
          "operation": "modify",
          "description": "Extend the component (if needed) to support a small thumbnail mode via className/size props so it can be reused safely in the admin list without layout shifts."
        }
      ]
    }
  ]
}