{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "BISAULI Shop: Stock-aware shopper UX, admin stock editing, and post-order product refresh",
  "requirements": [
    {
      "id": "REQ-125",
      "summary": "Show out-of-stock state in shopper product card grid and product details by replacing Add to Cart with an English \"Out of Stock\" label when stock is 0.",
      "acceptanceCriteria": [
        "Products with `stock === 0` still render in catalog/home/product listings and on the product details page.",
        "On `ProductCard`, when `stock === 0`, the primary action area shows an English \"Out of Stock\" label instead of the \"Add to Cart\" button.",
        "On `ProductDetailsPage`, when `stock === 0`, the Add to Cart button is not actionable and an English \"Out of Stock\" label is shown in place of the Add to Cart action text.",
        "No shopper UI displays a clickable Add to Cart action for `stock === 0`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/product/ProductCard.tsx",
          "operation": "modify",
          "description": "Update the primary action area so that when `product.stock === 0n`, the \"Add to Cart\" button is not rendered and is replaced with a non-clickable English \"Out of Stock\" label (keep the product card visible)."
        },
        {
          "path": "frontend/src/pages/ProductDetailsPage.tsx",
          "operation": "modify",
          "description": "Adjust the Add to Cart action so that when `product.stock === 0n`, it is not actionable and the button text is replaced with an English \"Out of Stock\" label (while keeping the product visible and details accessible)."
        }
      ]
    },
    {
      "id": "REQ-126",
      "summary": "Ensure the Admin product create/edit dialog includes an explicit editable Stock field with non-negative numeric validation and persists the value on save.",
      "acceptanceCriteria": [
        "Admin product create/edit form shows an editable Stock field with an English label (e.g., \"Stock Quantity\").",
        "Stock input only accepts non-negative numeric values and shows a clear English validation error when invalid.",
        "Saving a product updates the backend `Product.stock` to match the value entered in the admin form.",
        "After saving a stock change, the Admin products list reflects the updated stock without requiring a hard refresh (via existing React Query invalidation behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ProductEditorDialog.tsx",
          "operation": "modify",
          "description": "Harden Stock field validation to accept only non-negative numeric values (including allowing 0), display a clear English validation error when invalid (e.g., empty, NaN, negative, non-integer), and ensure the saved `Product` continues to include `stock` derived from the validated input."
        }
      ]
    },
    {
      "id": "REQ-127",
      "summary": "Invalidate the products query after successful order placement so shopper UI reflects updated stock without manual reload.",
      "acceptanceCriteria": [
        "On successful `placeOrder`, the frontend invalidates `queryKeys.products` in addition to existing cart/orders invalidations.",
        "After placing an order that reduces stock to 0, the relevant product(s) show out-of-stock UX on subsequent navigation without a hard reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/mutations/usePlaceOrder.ts",
          "operation": "modify",
          "description": "On successful `placeOrder`, also invalidate `queryKeys.products` (in addition to existing cart/orders/dashboard invalidations) so product stock changes are refetched and reflected across catalog/product pages."
        }
      ]
    }
  ]
}