{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin dashboard redeploy verification UX (frontend-only)",
  "requirements": [
    {
      "id": "REQ-85",
      "summary": "Ensure the admin UI supports unauthenticated access to /admin catalog CRUD after redeploy, with clear, retryable error states when the backend is unavailable.",
      "acceptanceCriteria": [
        "In the redeployed build, a fresh browser session can open `/admin/categories`, create a category, edit it, and delete it without any login flow or \"Unauthorized\" errors.",
        "In the redeployed build, a fresh browser session can open `/admin/products`, create a product, edit it, and delete it without any login flow or \"Unauthorized\" errors.",
        "No admin-login route is required to perform the above actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/queries/useAdminHealthCheck.ts",
          "operation": "create",
          "description": "Add an admin-scoped React Query hook that uses the anonymous admin actor to call `healthCheck()` and expose a retryable status for the admin area (success expects English text \"Running\")."
        },
        {
          "path": "frontend/src/pages/admin/AdminLayoutPage.tsx",
          "operation": "modify",
          "description": "Wire the admin health-check hook into the admin shell UI to show a small, English status indicator (Running / Unavailable with Retry) so /admin routes never appear blank and failures remain retryable instead of crashing the route."
        },
        {
          "path": "frontend/src/utils/backendAvailabilityErrors.ts",
          "operation": "modify",
          "description": "Ensure backend-unavailability detection and userMessage formatting remain English and are suitable for reuse by admin health-check + admin CRUD pages (retryable, no route-level crash messaging)."
        },
        {
          "path": "frontend/README.md",
          "operation": "modify",
          "description": "Update redeploy verification steps to explicitly confirm anonymous admin CRUD on `/admin/categories` and `/admin/products` in a fresh browser session, and to use the admin health indicator/healthCheck as the quick confirmation that the backend is running."
        }
      ]
    }
  ]
}